{
	"@metadata": {
		"authors": [
			"Alien333",
			"Gomoko",
			"Orlodrim",
			"Urhixidur",
			"Verdy p",
			"Wladek92",
			"Mahabarata"
		]
	},
	"apihelp-cirrus-config-dump-summary": "Dump de la configuration de CirrusSearch.",
	"apihelp-cirrus-config-dump-param-prop": "Type de variables de configuration à déverser",
	"apihelp-cirrus-config-dump-example": "Obtenir un vidage de la configuration de CirrusSearch",
	"apihelp-cirrus-mapping-dump-summary": "Vidage de la table de correspondance de CirrusSearch pour ce wiki.",
	"apihelp-cirrus-mapping-dump-example": "Obtenir un vidage de la table de correspondance de CirrusSearch pour ce wiki.",
	"apihelp-cirrus-settings-dump-summary": "Vidage des paramètres de CirrusSearch pour ce wiki.",
	"apihelp-cirrus-settings-dump-example": "Obtenir un vidage des paramètres de CirrusSearch pour ce wiki.",
	"apihelp-cirrus-profiles-dump-summary": "Vidage des profils CirrusSearch de ce wiki.",
	"apihelp-cirrus-profiles-dump-example": "Obtenir le vidage des profils CirrusSearch de ce wiki.",
	"apihelp-cirrus-profiles-dump-param-verbose": "Vider le contenu des profils",
	"apihelp-query+cirrusdoc-summary": "Vidage d’un document article CirrusSearch depuis les serveurs de recherche",
	"apihelp-query+cirrusdoc-example": "Obtenir le vidage d’un article unique CirrusSearch tel qu’il est actuellement indexé dans la recherche.",
	"apihelp-query+cirrusdoc-example-2": "Obtenir un vidage des paramètres de CirrusSearch pour ce wiki avec uniquement les catégories sélectionnées à l’aide du paramètre « includes ».",
	"apihelp-query+cirrusdoc-param-includes": "Définir quels champs doivent être renvoyés par la recherche.",
	"apihelp-query+cirrusbuilddoc-summary": "Vidage du document d’un article de CirrusSearch depuis les serveurs de base de données",
	"apihelp-query+cirrusbuilddoc-example": "Obtenir le vidage d’un unique article de CirrusSearch généré depuis la base de données.",
	"apihelp-query+cirrusbuilddoc-param-builders": "Type de données à extraire",
	"apihelp-query+cirrusbuilddoc-param-limiterprofile": "Profil à utiliser lors de la limitation de la taille du document",
	"apierror-cirrus-requesttoolong": "La requête de recherche de préfixe a dépassé la longueur maximale autorisée ($1 &gt; $2).",
	"apihelp-query+compsuggestbuilddoc-param-method": "La méthode de notation à utiliser",
	"apierror-compsuggestbuilddoc-bad-method": "Méthode de notation inconnue",
	"apihelp-query+cirruscompsuggestbuilddoc-summary": "Vidage du document utilisé par l’outil de suggestion de complétude",
	"apihelp-query+cirruscompsuggestbuilddoc-example": "Obtenir un vidage du document utilisé par l’outil de suggestion de complétude",
	"apihelp-query+cirruscompsuggestbuilddoc-param-method": "Fournir un nom de méthode d’évaluation à utiliser par l’outil de suggestion de complétude",
	"apihelp-cirrus-check-sanity-summary": "Rapporte l'exactitude d'une plage d'identifiants de page dans l'index de recherche",
	"apihelp-cirrus-check-sanity-example": "Obtenir un rapport sur l'exactitude d'une plage d'identifiants de page dans l'index de recherche",
	"apihelp-cirrus-check-sanity-param-cluster": "Le cluster de recherche pour vérifier les indices dans",
	"apihelp-cirrus-check-sanity-param-from": "Id de page où commencer la vérification",
	"apihelp-cirrus-check-sanity-param-limit": "Le nombre d'ids de page à vérifier",
	"apihelp-cirrus-check-sanity-param-sequenceid": "Le nombre de fois que cet ensemble d'ids de pages ont étés vérifiés",
	"apihelp-cirrus-check-sanity-param-rerenderfrequency": "Nombre de vérifications après lequel une page doit être affichée. Basé sur le sequenceid fourni.",
	"apiwarn-cirrus-ignore-revisions": "Plus d'une révision a été fournie pour une page. Seule la révision la plus récente sera renvoyée."
}
