{
	"@metadata": {
		"authors": [
			"ArenaL5",
			"Banjo",
			"Elisardojm",
			"Toliño"
		]
	},
	"apihelp-cirrus-config-dump-summary": "Descarga da configuración de CirrusSearch.",
	"apihelp-cirrus-config-dump-param-prop": "Tipo de variables de configuración a descargar",
	"apihelp-cirrus-config-dump-example": "Obter unha descarga da configuración de CirrusSearch.",
	"apihelp-cirrus-mapping-dump-summary": "Descarga da correspondencia de CirrusSearch para este wiki.",
	"apihelp-cirrus-mapping-dump-example": "Obter unha descarga da correspondencia de CirrusSearch para este wiki.",
	"apihelp-cirrus-settings-dump-summary": "Descarga dos parámetros de CirrusSearch para este wiki.",
	"apihelp-cirrus-settings-dump-example": "Obter unha descarga da configuración de CirrusSearch para este wiki.",
	"apihelp-cirrus-profiles-dump-summary": "Descarga dos perfís de CirrusSearch para este wiki.",
	"apihelp-cirrus-profiles-dump-example": "Obter unha descarga dos perfís de CirrusSearch para este wiki.",
	"apihelp-cirrus-profiles-dump-param-verbose": "Descargar o contigo dos perfís",
	"apihelp-query+cirrusdoc-summary": "Descarga do documento dun artigo de CirrusSearch dos servidores de procura",
	"apihelp-query+cirrusdoc-example": "Obter unha descarga dun artigo individual de CirrusSearch tal e como está indexado arestora na procura.",
	"apihelp-query+cirrusdoc-example-2": "Obter unha descarga da configuración de CirrusSearch para este wiki só coas categorías que se seleccionaron mediante o parámetro \"include\"",
	"apihelp-query+cirrusdoc-param-includes": "Definir os campos que debe devolver a procura.",
	"apihelp-query+cirrusbuilddoc-summary": "Descarga do documento dun artigo de CirrusSearch dos servidores da base de datos",
	"apihelp-query+cirrusbuilddoc-example": "Obter unha descarga dun artigo individual de CirrusSearch xerado a partir da base de datos.",
	"apihelp-query+cirrusbuilddoc-param-builders": "Tipo de datos a extraer",
	"apihelp-query+cirrusbuilddoc-param-limiterprofile": "Perfil a utilizar ao limitar o tamaño do documento",
	"apierror-cirrus-requesttoolong": "A solicitude de procura por prefixos é máis longa que a lonxitude máxima permitida ($1 &gt; $2).",
	"apihelp-query+compsuggestbuilddoc-param-method": "O método de puntuación a utilizar",
	"apierror-compsuggestbuilddoc-bad-method": "Método de puntuación descoñecido",
	"apihelp-query+cirruscompsuggestbuilddoc-summary": "Descarga do documento utilizado polas suxestións para completar",
	"apihelp-query+cirruscompsuggestbuilddoc-example": "Obter unha descarga do documento utilizado polas suxestións para completar",
	"apihelp-query+cirruscompsuggestbuilddoc-param-method": "Proporcionar un nome de método de puntuación para que o utilicen as suxestións para completar",
	"apihelp-cirrus-check-sanity-summary": "Informa sobre a corrección dun rango de identificadores de páxina no índice de procura",
	"apihelp-cirrus-check-sanity-example": "Obter un informe sobre a corrección dun rango de identificadores de páxina no índice de procura",
	"apihelp-cirrus-check-sanity-param-cluster": "A agrupación de procura na comprobar os índices",
	"apihelp-cirrus-check-sanity-param-from": "Identificador da páxina na que comezar a consultar",
	"apihelp-cirrus-check-sanity-param-limit": "O número de identificadores de páxina a comprobar",
	"apihelp-cirrus-check-sanity-param-sequenceid": "O número de veces que se comprobou este conxunto de identificadores de páxina",
	"apihelp-cirrus-check-sanity-param-rerenderfrequency": "Número de comprobacións despois das cales se debe volver renderizar unha páxina. Baseado no parámetro \"sequenceid\" proporcionado.",
	"apiwarn-cirrus-ignore-revisions": "Proporcionouse máis dunha revisión para unha páxina. Só se devolverá a revisión máis recente."
}
