{
	"@metadata": {
		"authors": [
			"McDutchie"
		]
	},
	"apihelp-cirrus-config-dump-summary": "Copia del configuration CirrusSearch.",
	"apihelp-cirrus-config-dump-param-prop": "Typo del variabiles de configuration a copiar",
	"apihelp-cirrus-config-dump-example": "Obtener un copia del configuration de CirrusSearch.",
	"apihelp-cirrus-mapping-dump-summary": "Copia del mappatura de CirrusSearch pro iste wiki.",
	"apihelp-cirrus-mapping-dump-example": "Obtener un copia del mappatura de CirrusSearch pro iste wiki.",
	"apihelp-cirrus-settings-dump-summary": "Copia del parametros de CirrusSearch pro iste wiki.",
	"apihelp-cirrus-settings-dump-example": "Obtener un copia del parametros de CirrusSearch pro iste wiki.",
	"apihelp-cirrus-profiles-dump-summary": "Copia del profilos de CirrusSearch pro iste wiki.",
	"apihelp-cirrus-profiles-dump-example": "Obterner un copia del profilos de CirrusSearch pro iste wiki.",
	"apihelp-cirrus-profiles-dump-param-verbose": "Generar un copia del contento del profilos",
	"apihelp-query+cirrusdoc-summary": "Instantaneo del documento de un articulo CirrusSearch ab le servitores de recerca",
	"apihelp-query+cirrusdoc-example": "Obtener un instantaneo de un articulo CirrusSearch individual como actualmente indexate in le motor de recerca.",
	"apihelp-query+cirrusdoc-example-2": "Obtener un copia del parametros de CirrusSearch pro iste wiki con solmente le categorias que ha essite seligite usante le parametro 'includes'",
	"apihelp-query+cirrusdoc-param-includes": "Definir qual campos debe esser restituite per le recerca.",
	"apihelp-query+cirrusbuilddoc-summary": "Copia del documento de un articulo CirrusSearch ab le servitores de base de datos",
	"apihelp-query+cirrusbuilddoc-example": "Obtener un copia de un sol articulo CirrusSearch generate ab le base de datos.",
	"apihelp-query+cirrusbuilddoc-param-builders": "Typo de datos a extraher",
	"apihelp-query+cirrusbuilddoc-param-limiterprofile": "Profilo a usar al limitar le grandor del documento",
	"apierror-cirrus-requesttoolong": "Le requesta de recerca per prefixo es plus longe que le dimension permittite. ($1 &gt; $2)",
	"apihelp-query+compsuggestbuilddoc-param-method": "Le methodo de punctage a usar",
	"apierror-compsuggestbuilddoc-bad-method": "Methodo de punctage incognite",
	"apihelp-query+cirruscompsuggestbuilddoc-summary": "Copia del documento usate per le suggestor de completiones",
	"apihelp-query+cirruscompsuggestbuilddoc-example": "Obtener un copia del documento usate per le suggestor de completiones",
	"apihelp-query+cirruscompsuggestbuilddoc-param-method": "Forni le nomine de un methodo de score a esser usate per le suggestor de completamento",
	"apihelp-cirrus-check-sanity-summary": "Reporta le correctessa de un intervallo de IDs de pagina in le indice de recerca",
	"apihelp-cirrus-check-sanity-example": "Obtener un reporto sur le correctessa de un intervallo de IDs de pagina in le indice de recerca",
	"apihelp-cirrus-check-sanity-param-cluster": "Le racemo de recerca in le qual verificar le indices",
	"apihelp-cirrus-check-sanity-param-from": "Le ID del pagina al qual comenciar le verification",
	"apihelp-cirrus-check-sanity-param-limit": "Le numero de IDs de pagina a verificar",
	"apihelp-cirrus-check-sanity-param-sequenceid": "Le numero de vices que iste gruppo de IDs de pagina ha essite verificate",
	"apihelp-cirrus-check-sanity-param-rerenderfrequency": "Numero de verificationes post le qual un pagina debe esser regenerate. Basate sur le ID de sequentia fornite.",
	"apiwarn-cirrus-ignore-revisions": "Plus de un version ha essite fornite pro un pagina. Solmente le version le plus recente essera restituite."
}
