{
	"@metadata": {
		"authors": [
			"Xuacu"
		]
	},
	"cirrussearch-desc": "Gueta col motor Elasticsearch pa MediaWiki",
	"cirrussearch-backend-error": "Nun pudimos completar la gueta por un problema temporal. Por favor, vuelva a intentalo más sero.",
	"cirrussearch-parse-error": "Nun s'entendió la consulta. Por favor, fáigala más cenciella. La consulta quedó rexistrada p'ameyorar el sistema de gueta.",
	"cirrussearch-regex-syntax-error": "Error de sintaxis na espresión regular en $2: $1",
	"cirrussearch-now-using": "Esta wiki ta usando un motor de gueta nuevu. ([[mw:Special:MyLanguage/Help:CirrusSearch|Ver más]])",
	"cirrussearch-ignored-headings": " #<!-- dexar esta llinia exactamente como ta --> <pre>\n# Testeres que nun se tendrán en cuenta na gueta.\n# Los cambios fechos equí son efeutivos nel momentu que s'indexa la páxina cola testera.\n# Pue forzar el reindexáu d'una páxina faciendo una edición nula.\n# La sintaxis ye la siguiente:\n#   * Tolo qu'hai dende un caráuter \"#\" al fin de llinia ye un comentariu\n#   * Cada llinia nun-balera ye'l títulu exactu a descartar, incluyendo mayúscules y demás\nReferencies\nEnllaces esternos\nVer tamién\n #</pre> <!-- dexar esta llinia exactamente como ta -->",
	"cirrussearch-boost-templates": " #<!-- dexar esta llinia exactamente como ta --> <pre>\n# Si una páxina contién una d'estes plantíes, la so puntuación na gueta multiplícase pol porcentax configuráu.\n# Los cambios equí son efeutivos darréu.\n# La sintaxis ye como sigue:\n#   * Cualquier cosa dende un caráuter \"#\" al fin de llinia ye un comentariu\n#   * Cada llinia non-balera ye'l nome de plantía exactu a aumentar, con espaciu de nomes, mayúscules, etc, siguíu por un caráuter \"|\", siguíu por un númberu, siguíu por un caráuter \"%\".\n# Exemplos de llinies correutes:\n# Plantía:Novedaes|150%\n# Plantía:Destacaos|300%\n# Plantía:Correxir|50%\n# Exemplos de llinies incorreutes:\n# Plantía:Foo|150,234234% <-- nun se permiten los decimales\n# Foo|150% <--- téunicamente funciona, pero sólo pa tresclusiones de la páxina Foo nel espaciu de nomes principal\n# Pue probar los cambios na configuración faciendo una consulta col prefixu boost-templates:\"XX\" onde XX son toles plantíes que quiera aumentar separaes con espacios en llugar de saltos de llinia.\n# Les consultes qu'especifiquen boost-templates:\"XX\" saltense'l conteníu d'esti campu.\n #</pre> <!-- dexar esta llinia exactamente como ta -->",
	"cirrussearch-pref-label": "Gueta nueva",
	"cirrussearch-pref-desc": "Pruebe la nuesa gueta nueva que tien sofitu pa más llingües, ufre resultaos más actuales, ya inda pue alcontrar testu dientro de les plantíes."
}
