{
	"@metadata": {
		"authors": [
			"Xuacu"
		]
	},
	"cirrussearch-desc": "Gueta col motor Elasticsearch pa MediaWiki",
	"cirrussearch-backend-error": "Nun pudimos completar la gueta por un problema temporal. Por favor, vuelva a intentalo más sero.",
	"cirrussearch-parse-error": "Nun s'entendió la consulta. Por favor, fáigala más cenciella. La consulta quedó rexistrada p'ameyorar el sistema de gueta.",
	"cirrussearch-too-busy-error": "La gueta ta sobrecargada nesti momentu. Vuelvi a intentalo más sero.",
	"cirrussearch-too-busy-for-you-anonymous-error": "Tienes demasiaes guetes simultanees n'execución. Si tas compartiendo una direición IP con otros usuarios puedes aniciar sesión pa recibir les tos propies llendes.",
	"cirrussearch-too-busy-for-you-logged-in-error": "Tienes demasiaes guetes simultanees n'execución.",
	"cirrussearch-regex-syntax-error": "Error de sintaxis na espresión regular en $2: $1",
	"cirrussearch-regex-too-busy-error": "Nesti momentu tán executándose demasiaes guetes con espresiones regulares. Vuelvi a intentalo más sero.",
	"cirrussearch-regex-too-complex-error": "La espresión regular ye complexa enforma. Deprendi más sobre cómo simplificala [[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|equí]].",
	"cirrussearch-now-using": "Esta wiki ta usando un motor de gueta nuevu. ([[mw:Special:MyLanguage/Help:CirrusSearch|Ver más]])",
	"cirrussearch-ignored-headings": " #<!-- dexar esta llinia exactamente como ta --> <pre>\n# Testeres que nun se tendrán en cuenta na gueta.\n# Los cambios fechos equí son efeutivos nel momentu que s'indexa la páxina cola testera.\n# Pue forzar el reindexáu d'una páxina faciendo una edición nula.\n# La sintaxis ye la siguiente:\n#   * Tolo qu'hai dende un caráuter \"#\" al fin de llinia ye un comentariu\n#   * Cada llinia nun-balera ye'l títulu exactu a descartar, incluyendo mayúscules y demás\nReferencies\nEnllaces esternos\nVer tamién\n #</pre> <!-- dexar esta llinia exactamente como ta -->",
	"cirrussearch-boost-templates": " #<!-- dexar esta llinia exactamente como ta --> <pre>\n# Si una páxina contién una d'estes plantíes, la so puntuación na gueta multiplícase pol porcentax configuráu.\n# Los cambios equí son efeutivos darréu.\n# La sintaxis ye como sigue:\n#   * Cualquier cosa dende un caráuter \"#\" al fin de llinia ye un comentariu\n#   * Cada llinia non-balera ye'l nome de plantía exactu a aumentar, con espaciu de nomes, mayúscules, etc, siguíu por un caráuter \"|\", siguíu por un númberu, siguíu por un caráuter \"%\".\n# Exemplos de llinies correutes:\n# Plantía:Novedaes|150%\n# Plantía:Destacaos|300%\n# Plantía:Correxir|50%\n# Exemplos de llinies incorreutes:\n# Plantía:Foo|150,234234% <-- nun se permiten los decimales\n# Foo|150% <--- téunicamente funciona, pero sólo pa tresclusiones de la páxina Foo nel espaciu de nomes principal\n# Pue probar los cambios na configuración faciendo una consulta col prefixu boost-templates:\"XX\" onde XX son toles plantíes que quiera aumentar separaes con espacios en llugar de saltos de llinia.\n# Les consultes qu'especifiquen boost-templates:\"XX\" saltense'l conteníu d'esti campu.\n #</pre> <!-- dexar esta llinia exactamente como ta -->",
	"cirrussearch-pref-label": "Gueta nueva",
	"cirrussearch-pref-desc": "Pruebe la nuesa gueta nueva que tien sofitu pa más llingües, ufre resultaos más actuales, ya inda pue alcontrar testu dientro de les plantíes.",
	"apihelp-cirrus-config-dump-description": "Volcáu de la configuración de CirrusSearch.",
	"apihelp-cirrus-mapping-dump-description": "Volcáu del mapéu de CirrusSearch pa esta wiki.",
	"apihelp-cirrus-settings-dump-description": "Volcáu de les preferencies de CirrusSearch pa esta wiki.",
	"cirrussearch-give-feedback": "Unvianos un comentariu",
	"cirrussearch-morelikethis-settings": " #<!-- dexa esta llinia tal y como ta --> <pre>\n# Esti mensaxe te permite configurar les preferencies de la carauterística «más como esto».\n# Esos cambios tienen efeutu inmediatamente.\n# La sintaxis ye como sigue:\n#   * To lo que va d'un caráuter «#» al final de la llinia ye un comentariu.\n#   * Cada llinia non-balera ye'l nome d'un axuste siguíu pol caráuter «:» siguíu pol valor del axuste\n# Los axustes son :\n#   * min_doc_freq (enteru): Númberu mínimu de documentos (per trozu) que necesita un términu pa que se considere.\n#   * max_doc_freq (enteru): Númberu máximu de documentos (per trozu) que necesita un términu pa que se considere.\n#                   Los términos con alta frecuencia de vezu son «palabres baleres».\n#   * max_query_terms (enteru): Númberu máximu de términos a considerar. Esti valor ta llendáu a $wgCirrusSearchMoreLikeThisMaxQueryTermsLimit (100).\n#   * min_term_freq (enteru): Númberu mínimu de veces qu'apaez el términu na entrada al documentu pa considerase. Pa campos pequeños (títulu) esti valor tien de ser 1.\n#   * percent_terms_to_match (flotante de 0 a 1): El porcentaxe de términos pa coincidir. Predeterminao de 0.3 (30 por cientu).\n#   * min_word_len (enteru): Llonxitú mínima d'un términu considerar. Predeterminao de 0.\n#   * max_word_len (enteru): La llonxitú máxima de palabra sobro la que s'inorarán les palabres. Predeterminao de sin llende (0).\n#   * fields (llista de valores separaos por comes): Estos son los campos a usar. Los campor permitidos son title, text, auxiliary_text, opening_text, headings y all.\n#   * use_fields (true|false) : Dicir a la consulta «más como esto» qu'use sólo los datos del campu. Predeterminao de false: el sistema estrayerá'l conteníu del campu de testu pa construir la consulta.\n# Exemplos de llinies bones:\n# min_doc_freq:2\n# max_doc_freq:20000\n# max_query_terms:25\n# min_term_freq:2\n# percent_terms_to_match:0.3\n# min_word_len:2\n# max_word_len:40\n# fields:text,opening_text\n# use_fields:true\n# </pre> <!-- dexa esta llinia tal y como ta -->",
	"cirrussearch-didyoumean-settings": "  #<!-- dexa esta llinia exautamente como ta --> <pre>\n# Esti mensaxe te permite configurar les preferencies de les suxerencies de «Queríes dicir».\n# Ver tamién https://www.elastic.co/guide/en/elasticsearch/reference/current/search-suggesters-phrase.html\n# Los cambios equí tienen efeutu inmediatu.\n# La sintaxis ye como sigue:\n#   * Too dende un caráuter \"#\" al final de la llinia ye un comentariu.\n#   * Cada llinia que nun tea en blanco ye'l nome de la preferencia siguíu por un caráuter \":\" siguíu pol valor de la preferencia\n# Les preferencies son :\n#   * max_errors (enteru): el máximu númberu de términos que se considera que son fallos ortográficos pa formar una correición. 1 o 2.\n#   * confidence (flotante): El nivel d'enfotu define un factor que s'aplica a la puntuación de les frases d'entrada y que s'usa como llende pa otres candidatures de suxerencies. Sólo los candidatos con puntuación mayor que la llende incluiráse nel resultáu. Por exemplu, un nivel d'enfotu de 1.0 sólo devolverá suxerencies que puntúen más alto que la frase d'entrada. Si se pon a 0.0 devuélvense los primeros N candidatos.\n#   * min_doc_freq (flotante de 0 a 1): La llende mínima en númberu de documentos onde tendría d'apaecer una suxerencia .\n#                   Los términos d'alta frecuencia de vezu son «palabres vacíes».\n#   * max_term_freq (flotante de 0 a 1): La llende máxima nel númberu de documentos onde puede existir un pase de testu de suxerencia pa que s'incluya.\n#   * prefix_length (enteru): El númberu  mínimu de carácteres del prefixu que tien de casar pa ser una candidata pa les suxerencies.\n#   * suggest_mode (missing, popular, always): El mou de suxerencies controla qué suxerencies s'incluyen o controla pa qué términos del testu tienen d'ufrise suxerencies.\n# Exemplos de llinies bien feches:\n# max_errors:2\n# confidence:2.0\n# max_term_freq:0.5\n# min_doc_freq:0.01\n# prefix_length:2\n# suggest_mode:always\n#\n# </pre> <!-- dexa esta llinia exautamente como ta -->"
}
