{
	"@metadata": {
		"authors": [
			"Fitoschido",
			"Jmarchn",
			"Lluis Cat",
			"QuimGil",
			"Toniher",
			"Vriullop",
			"Amire80",
			"Sma1997"
		]
	},
	"cirrussearch-desc": "Cerca realitzada amb Elasticsearch per a MediaWiki",
	"cirrussearch-backend-error": "No s'ha pogut completar la cerca per un problema temporal. Proveu-ho més endavant.",
	"cirrussearch-parse-error": "La consulta no s'ha pogut interpretar. Feu-la més simple. La consulta ha quedat registrada per millorar el sistema de cerca.",
	"cirrussearch-too-busy-error": "El servei de cerca està actualment saturat. Intenteu-ho més tard.",
	"cirrussearch-regex-empty-expression": "$1 espera una expressió regular no buida.",
	"cirrussearch-regex-syntax-error": "Error de sintexi d'expressió regular a $2: $1",
	"cirrussearch-regex-too-busy-error": "Hi ha massa cerques d'expressions regulars actualment en curs. Intenteu-ho més tard.",
	"cirrussearch-regex-too-complex-error": "L'expressió regular és massa complexa. Vegeu com simplificar-la [https://www.mediawiki.org/wiki/Special:MyLanguage/Help:CirrusSearch/RegexTooComplex aquí].",
	"cirrussearch-now-using": "Aquest wiki està utilitzant un nou motor de cerca. ([https://www.mediawiki.org/wiki/Special:MyLanguage/Help:CirrusSearch Més informació])",
	"cirrussearch-boost-templates": " #<!-- deixeu aquesta línia exactament com està --> <pre>\n# Si una pàgina conté una d'aquestes plantilles llavors la seva puntuació de cerca es multiplica pel percentatge indicat.\n# Els canvis tenen efecte immediatament.\n# La sintaxi és la següent:\n#   * Tot el que hi ha des d'un caràcter \"#\" fins al final de la línia és un comentari.\n#   * Cada línia no buida és el nom de la plantilla a promoure, de forma exacta i completa amb el seu espai de noms i les majúscules i minúscules, seguit d'un caràcter \"|\", més un número i un caràcter \"%\".\n# Exemples de línies correctes:\n# Plantilla:Bo|150%\n# Plantilla:Molt Molt bo|300%\n# Plantilla:Dolent|50%\n# Exemples de línies no vàlides:\n# Plantilla:Daixonses|150.234234% # no es permeten punts ni comes decimals!\n# Daixonses|150% # tècnicament funciona, però per les inclusions de la pàgina Daixonses de l'espai principal\n# Podeu provar els canvis de configuració fent una consulta amb el prefix boost-templates:\"XX\" on XX és el conjunt de plantilles que voleu promoure separades per espais en lloc de salts de línia.\n# Les consultes que especifiquin boost-templates:\"XX\" ignoren el contingut d'aquest camp.\n #</pre> <!-- deixeu aquesta línia exactament com està -->",
	"cirrussearch-pref-label": "Nou cercador",
	"cirrussearch-pref-desc": "Proveu el nostre cercador nou que suporta un nombre de llengües més gran, proporciona resultats més actualitzats i fins i tot pot trobar text dins de plantilles.",
	"cirrussearch-give-feedback": "Doneu-nos la vostra opinió",
	"cirrussearch-morelikethis-settings": " #<!-- deixeu aquesta línia exactament com està --> <pre>\n# Aquest missatge us permet configurar la configuració de la funció \"Més com això\".\n# Els canvis tenen efecte immediatament.\n# La sintaxi és la següent:\n#   * Tot des d'un caràcter \"#\" fins al final de la línia és un comentari.\n#   * Cada línia no buida és el nom del paràmetre seguit d'un caràcter \":\" seguit pel valor del paràmetre\n# Els paràmetres són:\n#   * min_doc_freq (enter): Nombre mínim de documents (per shard) que necessiten un terme per a que el terme sigui considerat.\n#   * max_doc_freq (enter): Nombre màxim de documents (per shard) que tenen un terme per a que el terme sigui considerat.\n#                   Els termes amb freqüència alta normalment són \"stop words\".\n#   * max_query_terms (enter): Nombre màxim de termes a considerar. Aquest valor està limitat a $wgCirrusSearchMoreLikeThisMaxQueryTermsLimit (100).\n#   * min_term_freq (enter): Nombre mínim de cops que el terme apareix a l'input del doc per a ser considerat. Per a camps petits (title) aquest valor hauria de ser 1.\n#   * minimum_should_match (percentatge -100% a 100%, o enter nombre de termes): El percentatge de termes que han de coincidir. El valor predeterminat és 30%.\n#   * min_word_len (enter): Llargada mínima d'un terme per a ser considerat. El valor predeterminat és 0.\n#   * max_word_len (enter): El tamany de paraula màxim a partir del que les paraules seran ignorades. El valor predeterminat és unbounded (0).\n#   * fields (llista de valors separats per comes): Aquests són els camps a utilitzar. Els valors acceptats són title, text, auxiliary_text, opening_text, headings.\n# Exemples de línies correctes:\n# min_doc_freq:2\n# max_doc_freq:20000\n# max_query_terms:25\n# min_term_freq:2\n# minimum_should_match:30%\n# min_word_len:2\n# max_word_len:40\n# fields:text,opening_text\n# </pre> <!-- deixeu aquesta línia exactament com està -->",
	"cirrussearch-didyoumean-settings": "  #<!-- deixeu aquesta línia exactament com està --> <pre>\n# Aquest missatge us permet configurar els paràmetres dels suggeriments de \"Volíeu dir\".\n# Vegeu també https://www.elastic.co/guide/en/elasticsearch/reference/current/search-suggesters-phrase.html\n# Els canvis tenen efecte immediatament.\n# La sintaxi és la següent:\n#   * Tot des d'un caràcter \"#\" fins al final de la línia es un comentari.\n#   * Cada línia no buida és el nom d'un paràmetre seguit d'un caràcter \":\" seguit del valor del paràmetre\n# Els paràmetres son:\n#   * max_errors (enter): el nombre màxim de termes que es consideraran mal escrits per a ser corregits. 1 o 2.\n#   * confidence (float): El nivell de confiança defineix un factor aplicat a la puntuació de de la frase d'entrada, que s'utilitza com a llindar per a altres candidats a suggeriment. Només candidats amb una puntuació més alta que el llindar s'inclouran al resultat. Per exemple, un nivell de confiança de 1.0 només retornarà suggeriments amb una puntuació més alta que la frase d'entrada. Si es defineix com a 0.0, es retornarà el millor candidat.\n#   * min_doc_freq (float 0 a 1): El llindar mínim de número de documents on hauria d'aparèixer un suggeriment.\n#                   Termes amb alta freqüència generalment són \"paraules buides\".\n#   * max_term_freq (float 0 a 1): El llindar màxim en número de documents en els que un terme pot existir per a ser inclòs.\n#   * prefix_length (enter): El nombre mínim de caràcters de prefix que han de coincidir amb un terme per a ser un suggeriment.\n#   * suggest_mode (missing, popular, always): Els mode de suggeriment controla la manera com els suggeriments són inclosos.\n# Exemples de línies bones:\n# max_errors:2\n# confidence:2.0\n# max_term_freq:0.5\n# min_doc_freq:0.01\n# prefix_length:2\n# suggest_mode:always\n#\n# </pre> <!-- deixeu aquesta línia exactament com està -->",
	"cirrussearch-query-too-long": "La sol·licitud de cerca és superior a la longitud màxima permesa. (Actual: $1; permesa: $2)",
	"cirrussearch-query-too-long-with-exemptions": "La sol·licitud de cerca és més llarga que la longitud màxima permesa. (Actual: $1; permesa: $2, sense comptar $3)",
	"cirrussearch-completion-profile-strict": "Perfil estricte amb pocs caràcters de puntuació eliminats, però mantenint els signes diacrítics i els accents.",
	"cirrussearch-completion-profile-classic": "Prefix clàssic, alguns caràcters de puntuació i alguns diacrítics eliminats.",
	"cirrussearch-completion-profile-normal": "Pocs caràcters de puntuació, alguns diacrítics i paraules buides eliminats.",
	"cirrussearch-completion-profile-normal-subphrases": "Pocs caràcters de puntuació, alguns diacrítics i paraules buides eliminats. També cercarà coincidències a subfrases (poden ser subfrases o subpàgines depenent dels paràmetres interns de la wiki).",
	"cirrussearch-completion-profile-fuzzy": "Semblant a la normal amb correcció tipogràfica (s'admeten dos errors tipogràfics).",
	"cirrussearch-completion-profile-fast-fuzzy": "Perfil difús experimental (pot ser eliminat en qualsevol moment)",
	"cirrussearch-completion-profile-fuzzy-subphrases": "Semblant a la normal amb correcció tipogràfica (s'admeten dos errors tipogràfics). També cercarà coincidències a subfrases (poden ser subfrases o subpàgines depenent dels paràmetres interns de la wiki).",
	"cirrussearch-qi-profile-classic": "Classificació basada en el nombre d'enllaços entrants, algunes plantilles, l'idioma de la pàgina i la data de publicació (potser plantilles/idioma/data de publicació recent no estan activats a aquesta wiki).",
	"cirrussearch-qi-profile-classic-noboostlinks": "Classificació basada en algunes plantilles, l'idioma de la pàgina i la data de publicació quan s'activa a aquest wiki.",
	"cirrussearch-qi-profile-empty": "Classificació basada únicament en característiques dependents de la consulta (només per a la depuració).",
	"cirrussearch-qi-profile-wsum-inclinks-pv": "Suma ponderada basada en els enllaços entrants i les visites a la pàgina setmanals",
	"cirrussearch-qi-profile-wsum-inclinks": "Suma ponderada basada en els enllaços entrants",
	"cirrussearch-qi-profile-popular-pv": "Classificació basada principalment en les visites a la pàgina",
	"cirrussearch-qi-profile-popular-inclinks": "Classificació basada principalment en el recompte d'enllaços entrants",
	"prefs-completion": "Compleció de cerques",
	"cirrussearch-pref-completion-section-desc": "Suggeridor de compleció",
	"cirrussearch-pref-completion-profile-help": "Defineix el comportament per als suggeriments d'autocompleció (cerca mentre s'escriu).\n\nEl [https://www.mediawiki.org/wiki/Special:MyLanguage/Extension:CirrusSearch/CompletionSuggester suggeridor de compleció] és un algoritme per a suggeriments de cerca amb una millor correcció d'errors tipogràfics i rellevància de cerca. La cerca de prefixos és l'algoritme de suggeriments de cerca mentre s'escriu tradicional.",
	"cirrussearch-completion-profile-fuzzy-pref-name": "Predeterminat (recomanat)",
	"cirrussearch-completion-profile-fuzzy-pref-desc": "Corregeix fins a dues errades tipogràfiques. Elimina les redireccions que són molt similars al títol principal.",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-name": "Coincidència de subfrases (recomanada per a títols de pàgina més llargs)",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-desc": "Corregeix fins a dues errades tipogràfiques. Resol redireccions properes. Cerca coincidències de la subfrase als títols.",
	"cirrussearch-completion-profile-strict-pref-name": "Mode estricte (avançat)",
	"cirrussearch-feature-deepcat-invalid-title": "La categoria proporcionada no és vàlida."
}
