{
	"@metadata": {
		"authors": [
			"Kghbln",
			"Metalhead64",
			"Michawiki"
		]
	},
	"cirrussearch-desc": "Ermöglicht eine auf „elasticsearch“ gestützte Suche",
	"cirrussearch-backend-error": "Deine Suche konnte aufgrund eines vorübergehenden Problems nicht abgeschlossen werden. Bitte später erneut versuchen.",
	"cirrussearch-parse-error": "Die Suchanfrage wurde nicht verstanden. Bitte mache sie einfacher. Die Anfrage wurde protokolliert, um das Suchsystem zu verbessern.",
	"cirrussearch-too-busy-error": "Die Suche ist derzeit überlastet. Bitte später erneut versuchen.",
	"cirrussearch-too-busy-for-you-anonymous-error": "Du lässt zu viele Suchanfragen gleichzeitig laufen. Falls du eine IP-Adresse mit anderen Benutzern teilst, kannst du dich anmelden, um deine eigenen Beschränkungen zu erhalten.",
	"cirrussearch-too-busy-for-you-logged-in-error": "Du lässt zu viele Suchanfragen gleichzeitig laufen.",
	"cirrussearch-regex-syntax-error": "Syntaxfehler des regulären Ausdrucks bei $2: $1",
	"cirrussearch-regex-too-busy-error": "Es werden derzeit zu viele Suchanfragen mit regulären Ausdrücken ausgeführt. Bitte später erneut versuchen.",
	"cirrussearch-regex-too-complex-error": "Der reguläre Ausdruck ist zu komplex. Erfahre [[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|hier]] mehr über seine Vereinfachung.",
	"cirrussearch-now-using": "Dieses Wiki verwendet eine neue Suchmaschine. ([[mw:Special:MyLanguage/Help:CirrusSearch|Mehr erfahren]])",
	"cirrussearch-ignored-headings": " #<!-- diese Zeile nicht verändern --> <pre>\n# Überschriften, die von der Suche ignoriert werden.\n# Diese Änderungen werden wirksam, sobald die Seite mit der Überschrift indexiert wurde.\n# Du kannst die Seitenindexierung erzwingen, indem du einen Nulledit durchführst.\n# Syntax:\n#   * Alles, was einer Raute („#“) bis zum Zeilenende folgt, ist ein Kommentar.\n#   * Jede nicht-leere Zeile ist der exakte zu ignorierende Titel.\nEinzelnachweise\nWeblinks\nSiehe auch\n #</pre> <!-- diese Zeile nicht verändern -->",
	"cirrussearch-boost-templates": " #<!-- Diese Zeile nicht verändern. --> <pre>\n# Falls eine Seite eine dieser Vorlagen enthält, wird der Such-Score mit dem konfigurierten Prozentsatz multipliziert.\n# Änderungen werden sofort wirksam.\n# Syntax:\n#   * Alles ab einer Raute („#“) bis zum Zeilenende ist ein Kommentar.\n#   * Jede nicht-leere Zeile ist der genaue Name der zu optimierenden Vorlage mit Namensraum und Unterscheidung zwischen Groß-/Kleinschreibung, gefolgt von einem Pipe-Symbol („|“), einer Zahl und einem Prozentzeichen („%“).\n# Beispiele funktionierender Zeilen:\n# Vorlage:Gut|150%\n# Vorlage:Sehr gut|300%\n# Vorlage:Schlecht|50%\n# Beispiele nicht funktionierender Zeilen:\n# Vorlage:Foo|150.234234% <-- Keine Dezimalstellen erlaubt!\n# Foo|150% <-- Technisch möglich, allerdings für Einbindungen der Seite „Foo“ aus dem Haupt-Namensraum.\n# Du kannst die Konfiguration durch eine Abfrage mit dem Präfix boost-templates:\"XX\" testen, wobei XX für alle Vorlagen steht, die du optimieren möchtest, getrennt durch Leerzeichen anstelle von Zeilenumbrüchen.\n# Abfragen mit boost-templates:\"XX\" ignorieren die Inhalte dieses Feldes.\n #</pre> <!-- Diese Zeile nicht verändern. -->",
	"cirrussearch-pref-label": "Neue Suche",
	"cirrussearch-pref-desc": "Teste unsere neue Suchmaschine, die eine größere Anzahl an Sprachen unterstützt, aktuellere Ergebnisse liefert und auch Text innerhalb Vorlagen finden kann."
}
