{
	"@metadata": {
		"authors": [
			"Dogogos123",
			"Geraki",
			"Giorgos456",
			"KATRINE1992",
			"NikosLikomitros",
			"Nikosgranturismogt",
			"Protnet",
			"Spyridon Eftychios Kokotos",
			"Twopix"
		]
	},
	"cirrussearch-desc": "Elasticsearch- αναζήτηση για το MediaWiki",
	"cirrussearch-backend-error": "Δεν μπορούμε να ολοκληρώσουμε την αναζήτησή σας λόγου προσωρινού προβλήματος. Παρακαλώ προσπαθήστε ξανά αργότερα.",
	"cirrussearch-parse-error": "Το ερώτημα δεν ήταν κατανοητό. Παρακαλούμε να το κάνετε απλούστερο. Το ερώτημα καταγράφτηκε για μελλοντική βελτίωση.",
	"cirrussearch-too-busy-error": "Η αναζήτηση είναι πολύ απασχολημένη αυτή τη στιγμή. Παρακαλούμε προσπαθήστε ξανά αργότερα.",
	"cirrussearch-regex-empty-expression": "$1 αναμένεται μια μη κενή τυπική έκφραση.",
	"cirrussearch-regex-syntax-error": "Συντακτικό σφάλμα στη κανονική έκφραση $2: $1",
	"cirrussearch-regex-too-busy-error": "Πάρα πολλές κανονικές εκφράσεις αναζητήσεις εκτελούνται αυτή τη στιγμή. Παρακαλώ προσπαθήστε ξανά αργότερα.",
	"cirrussearch-regex-too-complex-error": "Κανονική έκφραση είναι πολύ περίπλοκη. Μάθετε περισσότερα για την απλοποίηση του \n[[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|εδώ]]",
	"cirrussearch-now-using": "Αυτό το wiki χρησιμοποιεί μια νέα μηχανή αναζήτησης. ([[mw:Special:MyLanguage/Help:CirrusSearch|Μάθετε περισσότερα]])",
	"cirrussearch-boost-templates": "#<!-- αφήστε αυτή τη γραμμή όπως είναι --> <pre>\n# Αν η σελίδα περιέχει ένα από αυτά τα πρότυπα, τότε η βαθμολογία αναζήτησης πολλαπλασιάζεται με το καθορισμένο ποσοστό.\n# Αλλαγές σε αυτό ισχύουν αμέσως.\n# * Όλα από ένα χαρακτήρα \"#\" μέχρι το τέλος της γραμμής είναι ένα σχόλιο.\n# * Κάθε μη κενή γραμμή είναι το ακριβές όνομα του προτύπου για να ενισχύσει, namespace, case, που ακολουθείται από ένα \"|\" χαρακτήρα, ακολουθείται απο έναν αριθμό, ακολουθείται ένα \"%\" χαρακτήρα\n# Παραδείγματα καλής γραμμής:\n# Πρότυπο:Καλό|150%\n# Πρότυπο:Πάρα Πολύ Καλό|300%\n# Πρότυπο:Κακό|50%\n# Παραδείγματα μη εργάσιμες γραμμές:\n# Πρότυπο:Foo|150.234234% # δεν επιτρέπονται δεκαδικά ψηφία!\n# Foo|150% # πρακτικά δουλεύει, αλλά για τις ενσωματώσεις  της Foo σελίδας από το αρχικό namespace\n# Μπορείτε να δοκιμάσετε τις αλλαγές ρύθμισης παραμέτρων κατά την εκτέλεση ενός ερωτήματος με το πρόθεμα boost-templates:\"XX\", όπου XX είναι όλα τα πρότυπα που θέλετε να ενισχύσει χωρισμένα με κενά αντί της αλλαγής γραμμής.\n# Ερωτήματα που προσδιορίζουν την boost-templates:\"XX\" αγνοούν το περιεχόμενο αυτού του πεδίου.\n\n#<!-- αφήστε αυτή τη γραμμή όπως είναι --> <pre>",
	"cirrussearch-pref-label": "Νέα αναζήτηση",
	"cirrussearch-pref-desc": "Δοκιμάστε νέα μας αναζήτηση, η οποία υποστηρίζει μεγαλύτερο αριθμό γλωσσών, παρέχει πιο ενημερωμένα αποτελέσματα, και μπορεί ακόμη και να βρει κείμενο μέσα στα πρότυπα.",
	"cirrussearch-give-feedback": "Πείτε μας τη γνώμη σας",
	"cirrussearch-morelikethis-settings": "#<!-- leave this line exactly as it is --><pre> \n# Αυτό το μήνυμα σάς επιτρέπει να διαμορφώσετε τις ρυθμίσεις της δυνατότητας \"περισσότερα σαν αυτό\".\n# Οι αλλαγές σε αυτό ισχύουν αμέσως.\n# Η σύνταξη είναι η εξής:\n# * Όλα από ένα \" Ο χαρακτήρας #\" στο τέλος της γραμμής είναι ένα σχόλιο.\n# * Κάθε μη κενή γραμμή είναι το όνομα της ρύθμισης ακολουθούμενο από έναν χαρακτήρα \":\" ακολουθούμενο από την τιμή ρύθμισης\n# Οι ρυθμίσεις είναι:\n# * min_doc_freq (ακέραιος): Ελάχιστος αριθμός εγγράφων (ανά θραύσμα) που χρειάζονται όρο για να ληφθούν υπόψη.\n# * max_doc_freq (ακέραιος): Μέγιστος αριθμός εγγράφων (ανά θραύσμα) που έχουν όρο για να να ληφθούν υπόψη.\n# Οι όροι υψηλής συχνότητας είναι γενικά \"stop words\".\n# * max_query_terms (ακέραιος): Μέγιστος αριθμός όρων που πρέπει να ληφθούν υπόψη. Αυτή η τιμή περιορίζεται σε $wgCirrusSearchMoreLikeThisMaxQueryTermsLimit (100).\n# * min_term_freq (ακέραιος): Ελάχιστος αριθμός φορών που εμφανίζεται ο όρος στην είσοδο στο έγγραφο που πρέπει να ληφθεί υπόψη. Για μικρά πεδία (τίτλος) αυτή η τιμή πρέπει να είναι 1.\n# * minimum_should_match (ποσοστό -100% έως 100%, ή ακέραιος αριθμός όρων): Το ποσοστό των όρων προς αντιστοίχιση. Προεπιλογές στο 30%.\n# * min_word_len (ακέραιος): Ελάχιστη διάρκεια ενός όρου που πρέπει να ληφθεί υπόψη. Προεπιλογές σε 0.\n# * max_word_len (ακέραιος): Το μέγιστο μήκος λέξης πάνω από το οποίο οι λέξεις θα αγνοηθούν. Προεπιλογές σε πεδία χωρίς περιορισμούς (0).\n# * (λίστα τιμών διαχωρισμένη με κόμμα): Αυτά είναι τα πεδία προς χρήση. Επιτρεπόμενα πεδία είναι τίτλος, κείμενο, βοηθητικό_κείμενο, άνοιγμα_κείμενο, επικεφαλίδες.\n# Παραδείγματα καλών γραμμών:\n# min_doc_freq:2\n# max_doc_freq:20000\n# max_query_terms:25\n# min_term_freq:2 \n# minimum_should_match:30%\n# min_word_len:2\n# max_word_len:40\n# fields:text,opening_text\n#</pre><!-- leave this line exactly as it is -->",
	"cirrussearch-didyoumean-settings": "#<!-- leave this line exactly as it is --><pre> \n# Αυτό το μήνυμα σάς επιτρέπει να διαμορφώσετε τις ρυθμίσεις των προτάσεων \"Μήπως εννοούσατε\".\n# Δείτε επίσης https://www.elastic.co/guide/en/elasticsearch/reference/current/search-suggesters- phrase.html\n# Οι αλλαγές σε αυτό τίθενται σε ισχύ αμέσως.\n# Η σύνταξη είναι η εξής:\n# * Τα πάντα, από έναν χαρακτήρα \"#\" μέχρι το τέλος της γραμμής είναι ένα σχόλιο.\n# * Κάθε μη κενή γραμμή είναι το όνομα της ρύθμισης ακολουθούμενο από έναν χαρακτήρα \":\" ακολουθούμενο από την τιμή ρύθμισης\n# Οι ρυθμίσεις είναι :\n# * max_errors (ακέραιος): ο μέγιστος αριθμός όρων που θα θεωρηθούν ανορθόγραφοι προκειμένου να διορθωθεί. 1 ή 2.\n# * εμπιστοσύνη (float): Το επίπεδο εμπιστοσύνης ορίζει έναν παράγοντα που εφαρμόζεται στη βαθμολογία της φράσης εισαγωγής, ο οποίος χρησιμοποιείται ως όριο για άλλους υποψηφίους προτάσεων. Μόνο οι υποψήφιοι που βαθμολογούνται υψηλότερα από το όριο θα συμπεριληφθούν στο αποτέλεσμα. Για παράδειγμα, ένα επίπεδο εμπιστοσύνης 1,0 θα επιστρέψει μόνο προτάσεις με υψηλότερη βαθμολογία από τη φράση εισαγωγής. Εάν οριστεί σε 0,0, ο καλύτερος υποψήφιος θα επιστραφεί.\n# * min_doc_freq (float 0 έως 1): Το ελάχιστο όριο σε αριθμό εγγράφων στα οποία πρέπει να εμφανίζεται μια πρόταση.\n# Οι όροι υψηλής συχνότητας είναι γενικά \"stop words \".\n# * max_term_freq (float 0 έως 1): Το μέγιστο όριο σε αριθμό εγγράφων στα οποία μπορεί να υπάρχει ένας όρος για να συμπεριληφθεί.\n# * prefix_length (ακέραιος): Ο ελάχιστος αριθμός χαρακτήρων προθέματος που πρέπει να ταιριάζει με έναν όρο για να είναι πρόταση.\n# * suggest_mode (λείπει, δημοφιλής, πάντα): Η λειτουργία πρότασης ελέγχει τον τρόπο με τον οποίο περιλαμβάνονται οι προτάσεις.\n# Παραδείγματα καλών γραμμών:\n# max_errors :2\n# εμπιστοσύνη:2.0\n# max_term_freq:0.5\n# min_doc_freq:0.01\n# prefix_length:2\n# suggest_mode:πάντα\n#\n#</pre><!-- leave this line exactly as it is -->",
	"cirrussearch-query-too-long": "Το αίτημα αναζήτησης ήταν μεγαλύτερο από το μέγιστο επιτρεπόμενο μήκος. (Πραγματικό: $1 • επιτρεπτό: $2)",
	"cirrussearch-query-too-long-with-exemptions": "Το αίτημα αναζήτησης είναι μεγαλύτερο από το μέγιστο επιτρεπόμενο μήκος. (Πραγματικό:$1, επιτρεπτό:$2, χωρίς να υπολογίζεται $3 )",
	"cirrussearch-completion-profile-strict": "Αυστηρό προφίλ με λίγους χαρακτήρες στίξης που έχουν αφαιρεθεί, αλλά διατηρούνται τα διακριτικά σημεία και τα σημεία τονισμού.",
	"cirrussearch-completion-profile-classic": "Τυπικό πρόθεμα, μερικά σημεία στίξης και κάποια διακριτικά αφαιρέθηκαν.",
	"cirrussearch-completion-profile-normal": "Μερικά σημεία στίξης, κάποια διακριτικά και stopwords αφαιρέθηκαν.",
	"cirrussearch-completion-profile-normal-subphrases": "Μερικά σημεία στίξης, κάποια διακριτικά και stopwords αφαιρέθηκαν.Θα ταιριάζουν επίσης υποφράσεις (μπορεί να είναι υποφράσεις ή υποσελίδες ανάλογα με εσωτερική wiki διαμόρφωση).",
	"cirrussearch-completion-profile-fuzzy": "Παρόμοια του κανονικού με τυπογραφικό έλεγχο (υποστηρίζονται μέχρι δύο λάθη).",
	"cirrussearch-completion-profile-fast-fuzzy": "Πειραματικό ασαφές προφίλ (μπορεί να αφαιρεθεί ανά πάσα στιγμή)",
	"cirrussearch-completion-profile-fuzzy-subphrases": "Παρόμοια με την κανονική διόρθωση με τυπογραφικό λάθος (υποστηρίζει δύο λάθη). Θα ταιριάζει επίσης υποφράσεις (μπορεί να είναι υποφράσεις ή υποσελίδες ανάλογα με εσωτερική ρύθμιση του wiki).",
	"cirrussearch-qi-profile-classic": "Κατάταξη βάσει του αριθμού των εισερχόμενων συνδέσμων, μερικών προτύπων, της γλώσσας της σελίδας και της συχνότητας (τα πρότυπα/η γλώσσα/η συχνότητα ενδέχεται να μην είναι ενεργοποιημένα σε αυτό το wiki).",
	"cirrussearch-qi-profile-classic-noboostlinks": "Κατάταξη με βάση ορισμένα πρότυπα, τη γλώσσα της σελίδας και την συχνότητα όταν ενεργοποιείται σε αυτό το wiki.",
	"cirrussearch-qi-profile-empty": "Η κατάταξη βασίζεται αποκλειστικά σε χαρακτηριστικά που εξαρτώνται από το ερώτημα (μόνο για εντοπισμό σφαλμάτων).",
	"cirrussearch-qi-profile-wsum-inclinks-pv": "Σταθμισμένο άθροισμα με βάση τους εισερχόμενους συνδέσμους και τις εβδομαδιαίες προβολές σελίδας",
	"cirrussearch-qi-profile-wsum-inclinks": "Σταθμισμένο άθροισμα με βάση εισερχόμενους συνδέσμους",
	"cirrussearch-qi-profile-popular-pv": "Η κατάταξη βασίζεται κυρίως στις προβολές σελίδας",
	"cirrussearch-qi-profile-popular-inclinks": "Η κατάταξη βασίζεται κυρίως στον αριθμό των εισερχόμενων συνδέσμων",
	"prefs-completion": "Ολοκλήρωση αναζήτησης",
	"cirrussearch-pref-completion-section-desc": "Εισηγητής ολοκλήρωσης",
	"cirrussearch-pref-completion-profile-help": "Ρυθμίστε τη συμπεριφορά για τις προτάσεις αυτόματης συμπλήρωσης (αναζήτηση ως τύπος). O [https://www.mediawiki.org/wiki/Special:MyLanguage/Extension:CirrusSearch/CompletionSuggester completion suggester] είναι ένας αλγόριθμος για προτάσεις αναζήτησης με καλύτερη διόρθωση τυπογραφικών σφαλμάτων και συνάφεια αναζήτησης. Η αναζήτηση προθέματος είναι  παλαιού τύπου αλγόριθμος προτάσεων αναζήτησης search-as-you-type.",
	"cirrussearch-completion-profile-fuzzy-pref-name": "Προεπιλεγμένο (συνιστάται)",
	"cirrussearch-completion-profile-fuzzy-pref-desc": "Διορθώνει έως δύο τυπογραφικά λάθη. Καταργεί ανακατευθύνσεις που μοιάζουν πολύ με τον κύριο τίτλο.",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-name": "Αντιστοίχιση υποφράσης (συνιστάται για μεγαλύτερους τίτλους σελίδων)",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-desc": "Διορθώνει έως δύο τυπογραφικά λάθη. Επιλύει κοντινές ανακατευθύνσεις. Αντιστοιχίζει υποφράση στους τίτλους.",
	"cirrussearch-completion-profile-strict-pref-name": "Αυστηρή λειτουργία (για προχωρημένους)",
	"cirrussearch-completion-profile-strict-pref-desc": "Χωρίς τυπογραφική διόρθωση. Χωρίς accent folding. Αυστηρή αντιστοίχιση.",
	"cirrussearch-completion-profile-normal-pref-name": "Λειτουργία ανακατεύθυνσης  (για προχωρημένους)",
	"cirrussearch-completion-profile-normal-pref-desc": "Καμία διόρθωση ορθογραφικού λάθους. Επιλύει κλείσιμο ανακατευθύνσεων.",
	"cirrussearch-completion-profile-normal-subphrases-pref-name": "Λειτουργία ανακατεύθυνσης με ταίριασμα υποφράσης (για προχωρημένους)",
	"cirrussearch-completion-profile-normal-subphrases-pref-desc": "Μη διόρθωση τυπογραφικού λάθος. Επιλύει κλείσιμο ανακατευθυνσεών. Τέριασμα υποφράσεις σε τίτλους.",
	"cirrussearch-completion-profile-classic-pref-name": "Κλασικό πρόθεμα αναζήτησης",
	"cirrussearch-completion-profile-classic-pref-desc": "Μη διόρθωση τυπογραφικού λάθους. Ταιριάζει με την αρχή των τίτλων.",
	"cirrussearch-timed-out": "Το χρονικό όριο της αναζήτησης έληξε, επομένως είναι διαθέσιμα μόνο μερικά αποτελέσματα.",
	"cirrussearch-regex-timed-out": "Το χρονικό όριο της αναζήτησης regex έληξε, επομένως είναι διαθέσιμα μόνο μερικά αποτελέσματα. Προσπαθήστε να απλοποιήσετε την κανονική σας έκφραση για να έχετε πλήρη αποτελέσματα.",
	"cirrussearch-file-numeric-feature-not-a-number": "Ο όρος αναζήτησης '$1' απαιτεί αριθμητικές τιμές, αλλά παρέχεται '$2'.",
	"cirrusesarch-file-numeric-feature-multi-argument-w-sign": "Ο όρος αναζήτησης \"$1\" δεν επιτρέπει την παροχή πολλαπλών ορισμών και ενός πρόσημου με \"$2\".",
	"cirrussearch-feature-not-available": "Η λέξη-κλειδί αναζήτησης \"$1\" δεν είναι ενεργοποιημένη σε αυτό το wiki.",
	"cirrussearch-feature-too-many-conditions": "Παρέχονται πάρα πολλές συνθήκες στο \"$1\", περικόπτοντας στο $2.",
	"cirrussearch-feature-deepcat-endpoint": "Το $wgCirrusSearchCategoryEndpoint θα πρέπει να οριστεί σε ένα έγκυρο τελικό σημείο SPARQL για χρήση αναζήτησης κατηγοριών σε βάθος.",
	"cirrussearch-feature-deepcat-exception": "Η αναζήτηση σε βαθιά κατηγορία σε ερώτημα SPARQL απέτυχε",
	"cirrussearch-feature-deepcat-timeout": "Το χρονικό όριο της αναζήτησης σε βαθιά κατηγορία έληξε. Πιθανότατα η κατηγορία έχει πάρα πολλές υποκατηγορίες",
	"cirrussearch-feature-deepcat-toomany": "Το ερώτημα βαθιάς κατηγορίας επέστρεψε πάρα πολλές κατηγορίες",
	"cirrussearch-feature-deepcat-invalid-title": "Η παρεχόμενη κατηγορία δεν είναι έγκυρη.",
	"cirrussearch-feature-pageid-invalid-id": "Μη έγκυρη σελίδα {{PLURAL:$2|ID|ΙDs}}: $1",
	"cirrussearch-incategory-feature-no-valid-categories": "Δεν παράσχηκαν έγκυρες κατηγορίες στο '$1'.",
	"cirrussearch-mlt-feature-no-valid-titles": "Δεν παράσχηκαν έγκυροι τίτλοι στο '$1'.",
	"cirrussearch-mlt-not-configured": "Η δυνατότητα \" $1 \" δεν έχει ρυθμιστεί σωστά. Ζητήστε από έναν διαχειριστή να διορθώσει τα $wgCirrusSearchMoreLikeThis Fields",
	"cirrussearch-explore-similar-related-none": "Δεν υπάρχουν διαθέσιμες σχετικές σελίδες",
	"cirrussearch-article-words": "Λέξεις σε όλες τις σελίδες περιεχομένου",
	"cirrussearch-keyword-prefix-ns-mismatch": "Ο χώρος ονομάτων που βρέθηκε στο <code>πρόθημα:</code> δεν είναι συμβατός με τους χώρους ονομάτων που ζητήθηκαν. Μπορείτε να το διορθώσετε ορίζοντας το ερώτημά σας με <code>όλα:</code> .",
	"cirrussearch-autoselect-profile": "Αφήστε τη μηχανή αναζήτησης να αποφασίσει για το καλύτερο προφίλ που θα χρησιμοποιήσετε.",
	"cirrussearch-offset-too-large": "Δεν ήταν δυνατή η ανάκτηση αποτελεσμάτων. Υποστηρίζονται έως και $1 αποτελέσματα αναζήτησης, αλλά ζητήθηκαν αποτελέσματα που ξεκινούν από $2.",
	"cirrussearch-offset-not-allowed-with-random-sort": "Αγνόηση αιτήματος για σελιδοποίηση τυχαίων ταξινομημένων αποτελεσμάτων.",
	"cirrussearch-articletopic-invalid-topic": "Μη αναγνωρισμένο θέμα {{PLURAL:$2| όνομα|ονόματα}} για το <kbd>θέμα άρθρου:</kbd> λέξη-κλειδί: $1",
	"cirrussearch-inlanguage-deprecate-comma": "Η χρήση κόμματος ως διαχωριστικού για τη λέξη-κλειδί στην γλώσσα έχει καταργηθεί. Παρακαλώ χρησιμοποιήστε |(κάθετο) για να διαχωρίσετε γλώσσες."
}
