{
    "@metadata": {
        "authors": [
            "Ciencia Al Poder",
            "Csbotero",
            "Fitoschido",
            "Ihojose",
            "Luis Felipe Schenone"
        ]
    },
    "cirrussearch-desc": "Hace que la búsqueda sea con Solr",
    "cirrussearch-backend-error": "No pudimos completar tu búsqueda debido a un problema temporario. Por favor intenta de nuevo más tarde.",
    "cirrussearch-parse-error": "La queja no fue entendida. Hágala más sencilla. La queja fue registrada para mejorar el sistema de búsqueda.",
    "cirrussearch-now-using": "Esta wiki está utilizando un nuevo motor de búsqueda. ([[mw:Special:MyLanguage/Help:CirrusSearch|Ver más información]])",
    "cirrussearch-ignored-headings": " #\u003C!-- deje esta línea tal y como está --\u003E \u003Cpre\u003E\n# Títulos que serán ignorados por la búsqueda.\n# Los cambios estarán en vigor tan pronto como la página con el título esté indexada.\n# Puede forzar la página a ser reindexada haciendo una edición nula.\n# La sintaxis es la siguiente: .N!\n#   * Todo, desde un carácter \"#\" al final de la línea es un comentario\n#   * Todas las líneas en blanco es un título exacto para ignorar, caso y cualquier \nReferencia\nEnlaces externos\nVéase también\n #\u003C/pre\u003E \u003C!-- deje esta línea tal y como está --\u003E",
    "cirrussearch-boost-templates": " #\u003C!-- deja esta línea exactamente como está --\u003E \u003Cpre\u003E\n# Si una página contiene una de estas plantillas, entonces su puntuación en la búsqueda se multiplicará por el porcentaje configurado\n# Los cambios realizados aquí tendrán efecto de forma inmediata.\n# La sintaxis es la siguiente:\n#   * Todo el contenido desde un caracter \"#\" hasta el final de la línea se tomará como un comentario\n#   * Toda línea que no esté en blanco será el nombre exacto de la plantilla a impulsar, espacio de nombres, mayúsculas/minúsculas y todo, seguido por un caracter \"|\", un número y el carácter \"%\".\n# Ejemplos de líneas correctas:\n# Plantilla:Bueno|150%\n# Plantilla:Muy muy bueno|300%\n# Plantilla:Malo|50%\n# Ejemplos de líneas que no funcionarán:\n# Plantilla:Foo|150.234234% \u003C-- no se permiten decimales!\n# Foo|150% \u003C--- técnicamente funciona, pero para transclusiones de la página Foo del espacio de nombres principal\n# Puedes probar cambios en la configuración realizando una búsqueda que contenga como prefijo boost-templates:\"XX\", donde XX son todas las plantillas que quieras impulsar, separadas por espacios en lugar de saltos de línea.\n# Búsquedas que especifiquen boost-templates:\"XX\" ignorarán el contenido de este campo.\n #\u003C/pre\u003E \u003C!-- deja esta línea exactamente como está --\u003E",
    "cirrussearch-pref-label": "Búsqueda nueva",
    "cirrussearch-pref-desc": "Prueba nuestra nueva búsqueda que admite un mayor número de idiomas, ofrece resultados más actualizados hasta puede encontrar texto dentro de las plantillas."
}