{
	"@metadata": {
		"authors": [
			"Gomoko",
			"Jean-Frédéric",
			"Linedwell",
			"Robby"
		]
	},
	"cirrussearch-desc": "Fait effectuer la recherche par Solr",
	"cirrussearch-backend-error": "Nous n’avons pas pu mener à bien votre recherche à cause d’un problème temporaire. Veuillez réessayer ultérieurement.",
	"cirrussearch-parse-error": "La demande n’a pas été comprise. Veuillez la simplifier. La requête a été tracée pour améliorer le système de recherche.",
	"cirrussearch-regex-syntax-error": "Erreur de syntaxe de l’expression régulière en $2 : $1",
	"cirrussearch-now-using": "Ce wiki utilise un nouveau moteur de recherche. ([[mw:Special:MyLanguage/Help:CirrusSearch|en savoir plus]])",
	"cirrussearch-ignored-headings": " #<!-- laisser cette ligne comme telle --> <pre>\n# Titres de sections qui seront ignorés par la recherche\n# Les changements effectués ici prennent effet dès lors que la page avec le titre est indexée.\n# Vous pouvez forcer la réindexation de la page en effectuant une modification vide\n# La syntaxe est la suivante :\n#   * Toute ligne précédée d’un « # » est un commentaire\n#   * Toute ligne non-vide est le titre exact à ignorer, casse comprise\nRéférences\nLiens externes\nVoir aussi\n #</pre> <!-- laisser cette ligne comme telle -->",
	"cirrussearch-boost-templates": " #<!-- laisser cette ligne exactement en l’état --> <pre>\n# Si une page contient un de ces modèles alors son score de recherche sera multiplié par un pourcentage configuré.\n# Les modifications prennent effet immédiatement.\n# La syntaxe est la suivante :\n#   * Tout ce qui est entre un caractère '#' et la fin de la ligne est un commentaire\n#   * Toute ligne non vide est le nom exact dEvery non-blank line is the exact d’un modèle à promouvoir, avec espace de noms, casse exacte et complète, suivi d’un caractère '|' suivi d’un nombre suivi d’un caractère '%'.\n# Exemples de lignes correctes :\n# Modèle:Bon|150%\n# Modèle:Très Très bon|300%\n# Modèle:Mauvais|50%\n# Exemples de lignes non valides :\n# Modèle:Foo|150.234234% <-- pas de décimale autorisée !\n# Foo|150% <--- fonctionne techniquement, mais pour des inclusiosn de la page Foo depuis l’espace de noms principal\n# Vous pouvez tester les modifications de configuration en effectuant une recherche préfixée par boost-templates:\"XX\" où XX est l’ensemble des modèles que vous voulez promouvoir, séparés par des espaces au lieu de sauts de ligne.\n# Les requêtes qui spécifient boost-templates:\"XX\" ignorent le contenu de ce champ-ci.\n #</pre> <!-- laisser cette ligne exactement en l’état -->",
	"cirrussearch-pref-label": "Nouvelle recherche",
	"cirrussearch-pref-desc": "Essayer notre nouvelle recherche qui supporte un plus grand nombre de langues, fournit davantage de résultats à jour, et peut même trouver du texte dans les modèles."
}
