{
	"@metadata": {
		"authors": [
			"Elisardojm",
			"Toliño",
			"Vivaelcelta",
			"Banjo"
		]
	},
	"cirrussearch-desc": "Procura baseada en Elasticsearch para MediaWiki",
	"cirrussearch-backend-error": "Non puidemos completar a súa procura debido a un problema temporal. Inténteo de novo máis tarde.",
	"cirrussearch-parse-error": "Non se entendeu a pescuda. Fágaa máis sinxela. Rexistrouse a pescuda para mellorar o sistema de procuras.",
	"cirrussearch-too-busy-error": "O motor de busca está moi ocupado nestes intres. Por favor inténteo de novo máis tarde.",
	"cirrussearch-too-busy-for-you-anonymous-error": "Ten demasiadas buscas concurrentes en execución. Se está a compartir un enderzo IP con outros usuarios pode acceder ao sistema para recibir os seus propios límites.",
	"cirrussearch-too-busy-for-you-logged-in-error": "Ten demasiadas buscas concurrentes en execución.",
	"cirrussearch-regex-syntax-error": "Erro de sintaxe na expresión regular en $2: $1",
	"cirrussearch-regex-too-busy-error": "Hai demasiadas buscas con expresións regulares executandose neste intre. Por favor, ténteo de novo máis tarde.",
	"cirrussearch-regex-too-complex-error": "A expresión regular é demasiado complexa. Aprenda máis sobre cómo simplificala [[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|aquí]].",
	"cirrussearch-now-using": "Este wiki utiliza un novo motor de procuras. ([[mw:Special:MyLanguage/Help:CirrusSearch|Máis información]])",
	"cirrussearch-ignored-headings": " #<!-- Deixe esta liña tal e como está --> <pre>\n# Cabeceiras que serán ignoradas nas buscas.\n# Os cambios feitos aquí realízanse en canto se indexa a páxina coa cabeceira.\n# Pode forzar o reindexado da páxina facendo unha edición baleira.\n# A sintaxe é a seguinte:\n#   * Todo o que vaia despois dun carácter \"#\" ata o final da liña é un comentario\n#   * Toda liña que non estea en branco é o título exacto que ignorar, coas maiúsculas e minúsculas\nReferencias\nLigazóns externas\nVéxase tamén\n #</pre> <!-- Deixe esta liña tal e como está -->",
	"cirrussearch-boost-templates": " #<!-- Deixe esta liña tal e como está --> <pre>\n# Se unha páxina contén un destes modelos, entón a súa puntuación de procura multiplícase pola porcentaxe configurada.\n# Calquera cambio feito aplícase inmediatamente.\n# A sintaxe é a seguinte:\n#   * Todo o que vaia despois dun carácter \"#\" ata o final da liña é un comentario\n#   * Toda liña que non estea en branco é o modelo exacto que promover, co espazo de nomes, coas maiúsculas e minúsculas e completo, seguido dun carácter \"|\", seguido dun número, seguido dun carácter \"%\".\n# Exemplos de liñas correctas:\n# Modelo:Ben|150%\n# Modelo:Moi ben|300%\n# Modelo:Mal|50%\n# Exemplos de liñas que non funcionan:\n# Modelo:Erro|150.234234% <-- non están permitidos os puntos ou comas decimais!\n# Erro|150% <--- tecnicamente funciona, pero para as transclusións da páxina \"Erro\" desde o espazo de nomes principal\n# Pode probar os cambios na configuración levando a cabo unha pescuda con boost-templates:\"XX\", onde XX son todos os modelos que quere promover, separados por espazos no canto de saltos de liña.\n# As pescudas que especifican boost-templates:\"XX\" ignoran os contidos deste campo.\n #</pre> <!-- Deixe esta liña tal e como está -->",
	"cirrussearch-pref-label": "Nova pescuda",
	"cirrussearch-pref-desc": "Probe o noso novo buscador, que soporta un maior número de linguas, proporciona resultados máis actulizados e mesmo pode atopar texto dentro dos modelos.",
	"apihelp-cirrus-config-dump-description": "Volcado da configuración CirrusSearch",
	"apihelp-cirrus-mapping-dump-description": "Volcado do mapeo de CirrusSearch para esta wiki.",
	"apihelp-cirrus-settings-dump-description": "Volcado dos parámetros de CirrusSearch para esta wiki."
}
