{
	"@metadata": {
		"authors": [
			"Exec8"
		]
	},
	"cirrussearch-desc": "Elasticsearch-powered search para sa MediaWiki",
	"cirrussearch-backend-error": "Indi namon matapos ang imo pagpangita bangod sang temporaryo nga problema. Palihog tilawi liwat sa ulihi.",
	"cirrussearch-parse-error": "Ang pamangkot wala mahangpi. Palihog himua ini nga mas simple. Ang pamangkot gin-log agud mapauswag ang sistema sa pagpangita.",
	"cirrussearch-too-busy-error": "Ang pagpangita masako gid subong. Palihog tilawi liwat sa ulihi.",
	"cirrussearch-regex-empty-expression": "$1 nagapaabot sang isa ka indi unod nga regular nga ekspresyon.",
	"cirrussearch-regex-syntax-error": "Regular nga sayop sa syntax sang ekspresyon sa $2 : $1",
	"cirrussearch-regex-too-busy-error": "Madamo nga regular nga ekspresyon nga pagpangita ang nagapadayon subong. Palihog tilawi liwat sa ulihi.",
	"cirrussearch-regex-too-complex-error": "Ang regular nga ekspresyon tuman ka komplikado. Hibalua ang dugang pa parte sa pagpasimple sini [https://www.mediawiki.org/wiki/Special:MyLanguage/Help:CirrusSearch/RegexTooComplex diri].",
	"cirrussearch-now-using": "Ini nga wiki nagagamit sang bag-o nga makina sa pagpangita. ([https://www.mediawiki.org/wiki/Special:MyLanguage/Help:CirrusSearch Learn more])",
	"cirrussearch-boost-templates": "#<!-- ibilin ini nga linya sing eksakto subong sini --> <pre>\n# Kon ang isa ka pahina nagaunod sang isa sining mga sulundan nian ang iya marka sa pagpangita ginapadamo sang gin-configure nga porsyento.\n# Ang mga pagbag-o sa sini naga-epekto gilayon.\n# Ang syntax amo ang masunod:\n# * Ang tanan halin sa \"#\" nga karakter tubtob sa katapusan sang linya isa ka komento.\n# * Ang tagsa ka indi blangko nga linya amo ang eksakto nga ngalan sang sulundan nga i-boost, namespace, kaso kag tanan, nga ginasundan sang \"|\" karakter nga ginasundan sang numero nga ginasundan sang \"%\" nga karakter.\n# Mga halimbawa sang maayo nga mga linya:\n# Template:Maayo|150%\n# Template:Maayo gid|300%\n# Template:Malain|50%\n# Mga halimbawa sang mga linya nga wala nagatrabaho:\n# Template:Foo|150.234234% # wala sing decimal points nga ginatugutan!\n# Foo|150% # teknikal nga nagatrabaho, apang para sa mga pagbalhin sang pahina sang Foo gikan sa panguna nga namespace\n# Mahimo mo testingan ang mga pagbag-o sa configuration paagi sa paghimo sang isa ka pamangkot nga may prefix nga boost-templates:\"XX\" sa diin ang XX amo ang tanan nga mga template nga luyag mo nga i-boost nga ginseparar sang mga espasyo sa baylo sang mga line break.\n# Ang mga pamangkot nga nagatumod sang boost-templates:\"XX\" wala nagasapak sang mga kaundan sini nga field.\n #</pre> <!-- ibilin ini nga linya sing eksakto subong sini -->",
	"cirrussearch-pref-label": "Bag-o nga pagpangita",
	"cirrussearch-pref-desc": "Tilawi ang amon bag-o nga pagpangita nga nagasuporta sang mas madamo nga mga lenguahe, nagahatag sang mas bag-o nga mga resulta, kag makakita pa gani sang teksto sa sulod sang mga sulundan.",
	"cirrussearch-give-feedback": "Hatagi kami sang imo feedback",
	"cirrussearch-morelikethis-settings": "#<!-- ibilin ini nga linya sing eksakto subong sini --> <pre>\n# Ini nga mensahe nagapahanugot sa imo nga i-configure ang mga setting sang \"mas pareho sini\" nga bahin.\n# Ang mga pagbag-o sa sini naga-epekto gilayon.\n# Ang syntax amo ang masunod:\n# * Ang tanan halin sa \"#\" nga karakter tubtob sa katapusan sang linya isa ka komento.\n# * Ang tagsa ka indi blangko nga linya amo ang ngalan sang setting nga ginasundan sang \":\" nga karakter nga ginasundan sang bili sang setting\n# Ang mga setting amo ang:\n# * min_doc_freq (integer): Minimum nga numero sang mga dokumento (kada shard) nga nagakinahanglan sang termino para ini makonsiderar.\n# * max_doc_freq (integer): Pinakadamo nga numero sang mga dokumento (kada shard) nga may termino para sa sini nga pagabinagbinagon.\n# Ang mga termino nga may mataas nga frequency sa pangkabug-usan \"mga tinaga nga nagauntat\".\n# * max_query_terms (integer): Pinakadamo nga numero sang mga termino nga dapat binagbinagon. Ini nga balor limitado sa $wgCirrusSearchMoreLikeThisMaxQueryTermsLimit (100).\n# * min_term_freq (integer): Minimum nga numero sang mga beses nga ang termino makita sa input sa doc nga pagabinagbinagon. Para sa magagmay nga mga uma (titulo) ini nga balor dapat 1.\n# * minimum_should_match (porsyento -100% tubtob 100%, ukon integer nga numero sang mga termino): Ang porsyento sang mga termino nga dapat ipaanggid. Nagadefault sa 30%.\n# * min_word_len (integer): Minimum nga kalabaon sang isa ka termino nga dapat binagbinagon. Mga default sa 0.\n# * max_word_len (integer): Ang pinakamataas nga kalabaon sang tinaga sa ibabaw sang mga tinaga nga indi pagsapakon. Mga default sa unbounded (0).\n# * fields (listahan sang mga balor nga may comma): Amo ini ang mga field nga gamiton. Ang mga ginatugutan nga mga patag amo ang titulo, teksto, auxiliary_text, opening_text, mga ulohan.\n# Mga halimbawa sang maayo nga mga linya:\n# min_doc_freq:2\n# max_doc_freq:20000\n# max_query_terms:25\n# min_term_freq:2\n# minimum_should_match:30%\n# min_word_len:2\n# max_word_len:40\n# fields:text,opening_text\n# </pre> <!-- ibilin ini nga linya sing eksakto subong sini -->",
	"cirrussearch-didyoumean-settings": "#<!-- ibilin ini nga linya sing eksakto subong sini --> <pre>\n# Ini nga mensahe nagapahanugot sa imo nga i-configure ang mga setting sang \"Buot mo bala silingon\" nga mga panugda.\n# Tan-awa man ang https://www.elastic.co/guide/en/elasticsearch/reference/current/search-suggesters-phrase.html\n# Ang mga pagbag-o sa sini naga-epekto gilayon.\n# Ang syntax amo ang masunod:\n# * Ang tanan halin sa \"#\" nga karakter tubtob sa katapusan sang linya isa ka komento.\n# * Ang tagsa ka indi blangko nga linya amo ang ngalan sang setting nga ginasundan sang \":\" nga karakter nga ginasundan sang bili sang setting\n# Ang mga setting amo ang :\n# * max_errors (integer): ang pinakadamo nga numero sang mga termino nga pagakabigon nga sayop ang pagsulat agud matadlong. 1 ukon 2.\n# * pagsalig (float): Ang lebel sang pagsalig nagahatag kahulugan sang isa ka factor nga gina-apply sa score sang input phrase, nga ginagamit bilang threshold para sa iban nga mga kandidato sa panugda. Ang mga kandidato lang nga mas mataas ang score sangsa threshold ang ilakip sa resulta. Halimbawa, ang lebel sang pagsalig nga 1.0 magabalik lamang sang mga panugda nga mas mataas ang marka sangsa input phrase. Kon ibutang sa 0.0, ang pinakamaayo nga kandidato ibalik.\n# * min_doc_freq (float 0 to 1): Ang minimum nga threshold sa kadamuon sang mga dokumento nga dapat makita sang isa ka panugda.\n# Ang mga termino nga may mataas nga frequency sa pangkabug-usan \"mga tinaga nga nagauntat\".\n# * max_term_freq (float 0 to 1): Ang pinakamataas nga threshold sa kadamuon sang mga dokumento sa diin ang isa ka termino mahimo magluntad agud malakip.\n# * prefix_length (integer): Ang pinakadiutay nga numero sang mga karakter sang prefix nga dapat magsanto sa isa ka termino agud mangin isa ka panugda.\n# * suggest_mode (missing, popular, always): Ang suggest mode nagakontrol sang paagi sang paglakip sang mga panugda.\n# Mga halimbawa sang maayo nga mga linya:\n# max_errors:2\n# pagsalig:2.0\n# max_term_freq:0.5\n# min_doc_freq:0.01\n# prefix_length:2\n# suggest_mode:always\n#\n# </pre> <!-- ibilin ini nga linya sing eksakto subong sini -->",
	"cirrussearch-query-too-long": "Ang pangabay sa pagpangita mas malawig sangsa pinakamataas nga ginatugutan nga kalabaon. (Aktuwal: $1 ; ginatugutan: $2 )",
	"cirrussearch-query-too-long-with-exemptions": "Ang pangabay sa pagpangita mas malawig sangsa pinakamataas nga ginatugutan nga kalabaon. (Aktuwal: $1 , ginatugutan: $2 , wala ginaisip $3 )",
	"cirrussearch-completion-profile-strict": "Ang estrikto nga profile nga may pila ka mga karakter sa puntwasyon nga ginkuha apang ang mga diakritiko kag mga marka sang stress ginatipigan.",
	"cirrussearch-completion-profile-classic": "Klasiko nga prefix, pila ka mga karakter sa puntwasyon kag pila ka mga diakritiko nga ginkuha.",
	"cirrussearch-completion-profile-normal": "Pila ka mga karakter sa puntwasyon, ang pila ka mga diakritiko kag mga stopword ginkuha.",
	"cirrussearch-completion-profile-normal-subphrases": "Pila ka mga karakter sa puntwasyon, ang pila ka mga diakritiko kag mga stopword ginkuha. Magatumbas man ini sa mga subphrase (mahimo nga mga subphrase ukon subpage depende sa internal wiki configuration).",
	"cirrussearch-completion-profile-fuzzy": "Pareho sa normal nga may pagtadlong sang typo (duha ka typo ang ginasuportahan).",
	"cirrussearch-completion-profile-fast-fuzzy": "Ang eksperimento nga fuzzy profile (mahimo nga kuhaon sa bisan ano nga tion)",
	"cirrussearch-completion-profile-fuzzy-subphrases": "Pareho sa normal nga may pagtadlong sang typo (duha ka typo ang ginasuportahan). Magatumbas man ini sa mga subphrase (mahimo nga mga subphrase ukon subpage depende sa internal wiki configuration).",
	"cirrussearch-qi-profile-classic": "Ang pagranggo base sa kadamuon sang mga nagasulod nga mga sumpay, pila ka mga sulundan, lenguahe sang pahina kag bag-o (ang mga sulundan/linggwahe/bag-o mahimo nga indi ma-aktibo sa sini nga wiki).",
	"cirrussearch-qi-profile-classic-noboostlinks": "Pagranggo base sa pila ka mga sulundan, lenguahe sang pahina kag pagkabag-o kon gina-aktibo sa sini nga wiki.",
	"cirrussearch-qi-profile-empty": "Pagranggo base lamang sa mga bahin nga nagadepende sa pamangkot (para sa debug lamang).",
	"cirrussearch-qi-profile-wsum-inclinks-pv": "Ginbug-atan nga kabug-usan base sa nagasulod nga mga link kag semanal nga pagtan-aw sang pahina",
	"cirrussearch-qi-profile-wsum-inclinks": "Ginbug-atan nga kantidad base sa mga nagasulod nga mga sumpay",
	"cirrussearch-qi-profile-popular-pv": "Ang pagranggo base una sa mga pagtan-aw sa pahina",
	"cirrussearch-qi-profile-popular-inclinks": "Ang pagranggo base sa panguna sa mga pag-isip sang nagasulod nga mga link",
	"prefs-completion": "Pagtapos sang pagpangita",
	"cirrussearch-pref-completion-section-desc": "Sugyot sang pagkompleto",
	"cirrussearch-pref-completion-profile-help": "Ibutang ang pamatasan para sa autocomplete (search-as-you-type) nga mga panugda.\n\nAng [https://www.mediawiki.org/wiki/Special:MyLanguage/Extension:CirrusSearch/CompletionSuggester completion suggester] isa ka algorithm para sa mga panugda sa pagpangita nga may mas maayo nga pagtadlong sang typo kag kaangtanan sa pagpangita. Ang pagpangita sang prefix amo ang legacy search-as-you-type suggestion algorithm.",
	"cirrussearch-completion-profile-fuzzy-pref-name": "Default (ginarekomendar)",
	"cirrussearch-completion-profile-fuzzy-pref-desc": "Nagatadlong tubtob sa duha ka typos. Ginakuha ang mga redirect nga kaanggid gid sa panguna nga titulo.",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-name": "Pagpares sang subphrase (ginarekomendar para sa mas malaba nga mga titulo sang pahina)",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-desc": "Nagatadlong tubtob sa duha ka typos. Nagasolbar sang mga suod nga pag-redirect. Nagatupong sa subphrase sa mga titulo.",
	"cirrussearch-completion-profile-strict-pref-name": "Hugot nga paagi (abante)",
	"cirrussearch-completion-profile-strict-pref-desc": "Walay pagtul-id sa typo. Walay pagpilo sa accent. Hugot nga pagpares.",
	"cirrussearch-completion-profile-normal-pref-name": "Redirect mode (advanced)",
	"cirrussearch-completion-profile-normal-pref-desc": "Walay pagtul-id sa typo. Nagasolbar sang mga suod nga pag-redirect.",
	"cirrussearch-completion-profile-normal-subphrases-pref-name": "Redirect mode nga may subphrase matching (advanced)",
	"cirrussearch-completion-profile-normal-subphrases-pref-desc": "Walay pagtul-id sa typo. Nagasolbar sang mga suod nga pag-redirect. Nagatupong sa subphrase sa mga titulo.",
	"cirrussearch-completion-profile-classic-pref-name": "Klasiko nga pagpangita sang prefix",
	"cirrussearch-completion-profile-classic-pref-desc": "Walay pagtul-id sa typo. Nahiangay sa sinugdanan sa mga titulo.",
	"cirrussearch-timed-out": "Ang pagpangita natapos na, gani partial lang nga mga resulta ang matigayon.",
	"cirrussearch-regex-timed-out": "Ang pagpangita sa regex natapos na, gani partial lang nga mga resulta ang magamit. Tilawi nga pasimplehon ang imo regular nga ekspresyon agud makuha ang kompleto nga mga resulta.",
	"cirrussearch-file-numeric-feature-not-a-number": "Ang termino sa pagpangita nga ' $1 ' nagakinahanglan sang mga numero nga mga balor, apang ang ' $2 ' ginhatag.",
	"cirrusesarch-file-numeric-feature-multi-argument-w-sign": "Ang termino sa pagpangita nga ' $1 ' wala nagatugot sa paghatag sang madamo nga mga argumento kag isa ka tanda nga may ' $2 '.",
	"cirrussearch-feature-not-available": "Ang keyword sa pagpangita nga ' $1 ' wala gina-enable sa sini nga wiki.",
	"cirrussearch-feature-too-many-conditions": "Madamo nga mga kondisyon ang ginhatag sa ' $1 ', nga naga-utod sa $2 .",
	"cirrussearch-feature-deepcat-endpoint": "Ang $wgCirrusSearchCategoryEndpoint dapat ibutang sa isa ka balido nga SPARQL endpoint sa paggamit sang madalom nga pagpangita sang kategorya.",
	"cirrussearch-feature-deepcat-exception": "Ang madalom nga kategorya nga pagpangita sang SPARQL nga pamangkot napaslawan",
	"cirrussearch-feature-deepcat-timeout": "Ang pagpangita sa madalom nga kategorya natapos na. Mahimo gid nga ang kategorya may madamo nga mga subkategorya",
	"cirrussearch-feature-deepcat-invalid-title": "Ang ginhatag nga kategorya indi balido.",
	"cirrussearch-feature-pageid-invalid-id": "Indi balido nga pahina {{PLURAL:$2|ID|IDs}}: $1",
	"cirrussearch-incategory-feature-no-valid-categories": "Wala sing balido nga mga kategorya nga ginhatag sa ' $1 '.",
	"cirrussearch-mlt-feature-no-valid-titles": "Wala sing balido nga mga titulo nga ginhatag sa ' $1 '.",
	"cirrussearch-mlt-not-configured": "Ang ' $1 ' nga bahin sayop nga na-configure. Pangabaya ang isa ka admin nga ayuhon ang $wgCirrusSearchMoreLikeThisFields",
	"cirrussearch-explore-similar-related-none": "Wala sing may kaangtanan nga mga pahina nga magamit",
	"cirrussearch-article-words": "Mga tinaga sa tanan nga mga pahina sang kaundan",
	"cirrussearch-keyword-prefix-ns-mismatch": "Ang namespace nga makita sa search term <code>prefix:</code> indi nagakaigo sa mga namespace nga ginapangayo. Mahimo mo ini ayuhon paagi sa pag-una sang imo pamangkot sa <code>all:</code> .",
	"cirrussearch-autoselect-profile": "Tuguti ang search engine nga magdesisyon sa pinakamaayo nga profile nga gamiton.",
	"cirrussearch-offset-too-large": "Indi makuha ang mga resulta. Ang mga resulta sang pagpangita tubtob sa $1 ginasuportahan, apang ang mga resulta nga nagasugod sa $2 ginpangabay.",
	"cirrussearch-offset-not-allowed-with-random-sort": "Ginabalewala ang pangabay nga i-paginate ang mga resulta nga gin-sort sing random.",
	"cirrussearch-articletopic-invalid-topic": "Wala makilala nga topiko {{PLURAL:$2| ngalan|mga ngalan}} para sa <kbd>topiko sang artikulo:</kbd> keyword: $1",
	"cirrussearch-inlanguage-deprecate-comma": "Ang paggamit sang koma bilang separator para sa inlanguage keyword wala na ginagamit. Palihog gamit sang | (pipe) sa pagbulag sa mga pinulongan."
}
