{
    "@metadata": {
        "authors": [
            "Beta16",
            "Rosh"
        ]
    },
    "cirrussearch-desc": "Ricerca realizzata con Elasticsearch per MediaWiki",
    "cirrussearch-backend-error": "Non si è riuscito a completare la tua ricerca a causa di un problema temporaneo. Riprova più tardi.",
    "cirrussearch-parse-error": "Non è possibile interpretare la query. Si prega di renderla più semplice. La query è stata registrata per migliorare il sistema di ricerca.",
    "cirrussearch-now-using": "Questo wiki usa un nuovo motore di ricerca. ([[mw:Special:MyLanguage/Help:CirrusSearch|Ulteriori informazioni]])",
    "cirrussearch-ignored-headings": " #\u003C!-- lascia questa riga esattamente come è --\u003E \u003Cpre\u003E\n# Elenco delle intestazioni che saranno ignorate dalla ricerca.\n# Le modifiche a questa pagina saranno effettive non appena la pagina sarà indicizzata.\n# Puoi forzare la re-indicizzazione di una pagina effettuando una modifica nulla.\n# La sintassi è la seguente:\n#   * Tutto dal carattere \"#\" alla fine della riga è un commento\n#   * Tutte le righe non vuote sono le intestazioni esatte da ignorare, maiuscolo/minuscolo e tutto\nNote\nVoci correlate\nCollegamenti esterni\n #\u003C/pre\u003E \u003C!-- lascia questa riga esattamente come è --\u003E",
    "cirrussearch-boost-templates": " #\u003C!-- lascia questa riga esattamente come è --\u003E \u003Cpre\u003E\n# Se una pagina contiene uno dei seguenti template, allora il suo punteggio di ricerca è moltiplicato per la percentuale indicata.\n# Le modifiche a questa pagina saranno effettive immediatamente.\n# La sintassi è la seguente:\n#   * Tutto dal carattere \"#\" alla fine della riga è un commento\n#   * Tutte le righe non vuote sono i template esatti da modificare, namespace, maiuscolo/minuscolo e tutto, seguiti da un carattere \"|\", da un numero, e da un carattere \"%\".\n# Esempi di righe corrette:\n# Template:Buono|150%\n# Template:Molto molto buono|300%\n# Template:Male|50%\n# Esempi di righe errate:\n# Template:Prova|150.234234% \u003C-- non sono consentiti decimali!\n# Prova|150% \u003C--- tecnicamente funziona, ma per inclusioni della pagina \"Prova\" dal namespace principale\n# Puoi provare le modifiche alla configurazione eseguendo una ricerca inserendo il prefisso boost-templates:\"XX\" dove XX sono tutti i template da modificare, separati da uno spazio.\n# Le ricerche con boost-templates:\"XX\" ignorano il contenuto di questa pagina.\n #\u003C/pre\u003E \u003C!-- lascia questa riga esattamente come è --\u003E",
    "cirrussearch-pref-label": "Nuova ricerca",
    "cirrussearch-pref-desc": "Prova la nostra nuova ricerca, che supporta un numero maggiore di lingue, fornisce risultati più aggiornati e può anche trovare il testo all'interno di template."
}