{
	"@metadata": {
		"authors": [
			"Beta16",
			"Rosh",
			"Lucas2",
			"Mpiva",
			"Alexmar983",
			"AndreaBaitelli"
		]
	},
	"cirrussearch-desc": "Ricerca realizzata con Elasticsearch per MediaWiki",
	"cirrussearch-backend-error": "Non si è riuscito a completare la tua ricerca a causa di un problema temporaneo. Riprova più tardi.",
	"cirrussearch-parse-error": "Non è possibile interpretare la query. Si prega di renderla più semplice. La query è stata registrata per migliorare il sistema di ricerca.",
	"cirrussearch-too-busy-error": "Attualmente il motore di ricerca è sovraccarico. Riprova più tardi.",
	"cirrussearch-too-busy-for-you-anonymous-error": "Hai troppe ricerche in corso contemporaneamente. Se stai condividendo un indirizzo IP con altri utenti, puoi effettuare l'accesso per operare con i tuoi limiti.",
	"cirrussearch-too-busy-for-you-logged-in-error": "Hai troppo ricerche contemporaneamente in corso.",
	"cirrussearch-regex-syntax-error": "Errore di sintassi nell'espressione regolare a $2: $1",
	"cirrussearch-regex-too-busy-error": "Attualmente troppe ricerche con espressioni regolari in esecuzione. Riprova più tardi.",
	"cirrussearch-regex-too-complex-error": "L'espressione regolare è troppo complessa. Approfondisci [[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|qui]] come semplificarla.",
	"cirrussearch-now-using": "Questo progetto wiki utilizza un nuovo motore di ricerca ([[mw:Special:MyLanguage/Help:CirrusSearch|maggiori informazioni]]).",
	"cirrussearch-ignored-headings": " #<!-- lascia questa riga esattamente come è --> <pre>\n# Elenco delle intestazioni che saranno ignorate dalla ricerca.\n# Le modifiche a questa pagina saranno effettive non appena la pagina sarà indicizzata.\n# Puoi forzare la re-indicizzazione di una pagina effettuando una modifica nulla.\n# La sintassi è la seguente:\n#   * Tutto dal carattere \"#\" alla fine della riga è un commento\n#   * Tutte le righe non vuote sono le intestazioni esatte da ignorare, maiuscolo/minuscolo e tutto\nNote\nVoci correlate\nCollegamenti esterni\n #</pre> <!-- lascia questa riga esattamente come è -->",
	"cirrussearch-boost-templates": " #<!-- lascia questa riga esattamente come è --> <pre>\n# Se una pagina contiene uno dei seguenti template, allora il suo punteggio di ricerca è moltiplicato per la percentuale indicata.\n# Le modifiche a questa pagina saranno effettive immediatamente.\n# La sintassi è la seguente:\n#   * Tutto dal carattere \"#\" alla fine della riga è un commento\n#   * Tutte le righe non vuote sono i template esatti da modificare, namespace, maiuscolo/minuscolo e tutto, seguiti da un carattere \"|\", da un numero, e da un carattere \"%\".\n# Esempi di righe corrette:\n# Template:Buono|150%\n# Template:Molto molto buono|300%\n# Template:Male|50%\n# Esempi di righe errate:\n# Template:Prova|150.234234% <-- non sono consentiti decimali!\n# Prova|150% <--- tecnicamente funziona, ma per inclusioni della pagina \"Prova\" dal namespace principale\n# Puoi provare le modifiche alla configurazione eseguendo una ricerca inserendo il prefisso boost-templates:\"XX\" dove XX sono tutti i template da modificare, separati da uno spazio.\n# Le ricerche con boost-templates:\"XX\" ignorano il contenuto di questa pagina.\n #</pre> <!-- lascia questa riga esattamente come è -->",
	"cirrussearch-pref-label": "Nuova ricerca",
	"cirrussearch-pref-desc": "Prova la nostra nuova ricerca, che supporta un numero maggiore di lingue, fornisce risultati più aggiornati e può anche trovare il testo all'interno di template.",
	"apihelp-cirrus-config-dump-description": "Copia della configurazione di CirrusSearch.",
	"apihelp-cirrus-mapping-dump-description": "Copia della mappatura di CirrusSearch di questa wiki.",
	"apihelp-cirrus-settings-dump-description": "Copia delle impostazioni di CirrusSearch di questa wiki.",
	"apihelp-cirrus-suggest-description": "Suggerimento del completamente per il termine di ricerca.",
	"apihelp-cirrus-suggest-param-text": "Termine di ricerca per cui fornire il suggerimento del completamento.",
	"apihelp-cirrus-suggest-param-limit": "Quanti risultati restituire.",
	"apihelp-cirrus-suggest-param-context": "I contesti di ricerca possono circoscrivere la ricerca, come <kbd>geo</kbd> o <kbd>categoria</kbd>.",
	"cirrussearch-give-feedback": "Dacci il tuo feedback",
	"cirrussearch-query-too-long": "Il testo della ricerca ha una dimesione maggiore rispetto a quella permessa. ($1 > $2)",
	"cirrussearch-completionsuggester-pref": "Suggeritore completamento",
	"cirrussearch-completionsuggester-desc": "E' un nuovo algoritmo per migliorare la ricerca durante la digitazione. Una volta attivata la casella di ricerca nell'angolo in alto a destra, verrà utilizzato questa funzione che suggerisce il possibile completamente della parola che si sta inserendo per la ricerca."
}
