{
	"@metadata": {
		"authors": [
			"Bjankuloski06"
		]
	},
	"cirrussearch-desc": "Пребарување со Solr",
	"cirrussearch-backend-error": "Не можам наполно да го изведам пребарувањето поради привремен проблем. Обидете се подоцна.",
	"cirrussearch-parse-error": "Не го разбрав барањето. Упростете го. Ова го заведувам за да го подобриме пребарувачкиот систем.",
	"cirrussearch-too-busy-error": "Пребарувањето во моментов е презафатено. Обидете се подоцна.",
	"cirrussearch-too-busy-for-you-anonymous-error": "Имате премногу тековни пребарувања. Доколку имате заедничка IP-адреса со други корисници, можете да се најавите со ваша сметка за да го добиете вашето следување.",
	"cirrussearch-too-busy-for-you-logged-in-error": "Имате премногу пребарувања во тек.",
	"cirrussearch-regex-syntax-error": "Синтаксна грешка на регуларниот израз во $2: $1",
	"cirrussearch-regex-too-busy-error": "Во моментов има премногу пребарувања на регуларни изрази. Обидете се подоцна.",
	"cirrussearch-regex-too-complex-error": "Регуларниот израз е пресложен. Дознајте повеќе за неговото упростување [[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|тука]].",
	"cirrussearch-now-using": "Ова вики користи нов пребарувач. ([[mw:Special:MyLanguage/Help:CirrusSearch|Дознајте повеќе]])",
	"cirrussearch-ignored-headings": " #<!-- не менувајте ништо во овој ред --> <pre>\n# Заглавија што ќе се занемарат при пребарувањето.\n# Измените во ова ќе стапат на сила штом ќе се индексира страницата со заглавието.\n# Можете да наметнете преиндексирање на страницата ако извршите празно уредување.\n# Синтаксата е следнава:\n#   * Сето она што од знакот „#“ до крајот на редот е коментар\n#   * Секој непразен ред е точниот наслов што треба да се занемари, разликувајќи големи од мали букви и сето останато\nНаводи\nНадворешни врски\nПоврзано\n #</pre> <!-- не менувајте ништо во овој ред -->",
	"cirrussearch-boost-templates": " #<!-- не менувајте го овој ред --> <pre>\n# Ако една страница содржи еден од овие шаблони, тогаш добиеното салдо од пребарувањето се множи со зададениот постоток.\n# Измените во ова веднаш стапуваат на сила.\n# Синтаксата е следнава:\n#   * Сето она што стои од знакот „#“ до крајот на редот е коментар\n#   * Секој непразен ред претставува точно има на шаблонот за оптимизирање (сосе именскиот простор, запазени големи/мали букви и сето останато), проследено од знакот „|“, па број, па знакот „%“.\n# Примери за редови што работат:\n# Шаблон:Добро|150%\n# Шаблон:Многу добро|300%\n# Шаблон:Лошо|50%\n# Примери за редови што не би работеле:\n# Шаблон:Foo|150.234234% <-- не се дозволени децимали!\n# Foo|150% <--- технички работи, но за превметнување на страницата „Foo“ од главниот именски простор\n# Можете да ги испробате измените во поставките извршувајќи барање со претставката boost-templates:„XX“, каде XX се сите шаблони што сакате да ги оптимизирате одделени со празни места наместо нови редови.\n# Барањата што укажуваат boost-templates:„XX“ ја занемаруваат содржината на ова поле.\n #</pre> <!-- не менувајте го овој ред -->",
	"cirrussearch-pref-label": "Ново пребарување",
	"cirrussearch-pref-desc": "Пробајте го нашето ново пребарување кое поддржува поголем број јазици, дава потековни и понавремени резултати, па дури и наоѓа текст во шаблони.",
	"apihelp-cirrus-config-dump-description": "Резервен склад на поставките на CirrusSearch.",
	"apihelp-cirrus-mapping-dump-description": "Резервен склад на пресликувањата на CirrusSearch за ова вики.",
	"apihelp-cirrus-settings-dump-description": "Резервен склад на поставките на CirrusSearch за ова вики.",
	"cirrussearch-give-feedback": "Дајте ни ваше мислење",
	"cirrussearch-morelikethis-settings": " #<!-- не го менувајте редов --> <pre>\n# Поракава ви овозможува да ги наместите поставките за функцијата „повеќе вакви“.\n# Направените промени во поставките веднаш стапуваат на сила.\n# Синтаксата е следнава:\n#   * Сето она од знакот „#“ до крајот на редот е коментар.\n#   * Секој непразен ред е име на поставката последено од знак „:“ проследен од вредноста на поставката\n# Поставките се :\n#   * min_doc_freq (цел број): Најмал број на документи (по одделок) на кои ќе им треба израз за да се земат предвид.\n#   * max_doc_freq (цел број): Најмал број на документи (по одделок) што имаат израз за земање предвид.\n#                   Позастапени поими начелно се „шумни зборови“.\n#   * max_query_terms (цел број): Најголем број на изрази за земање предвид. Оваа вредност е ограничена на $wgCirrusSearchMoreLikeThisMaxQueryTermsLimit (100).\n#   * min_term_freq (цел број): Најмалку јавувања на изразот во вносот на документот што се зема предвид. За мали полиња (наслов) оваа вредност треба да биде 1.\n#   * percent_terms_to_match (се колеба од 0 до 1): The percentage of terms to match on. Пои основно 0.3 (30 отсто).\n#   * min_word_len (цел број): Најмала должина на изразот што се зема предвид. По основно: 0.\n#   * max_word_len (цел број): Најголема должина на зборовите над која истите ќе бидат занемарени. По основно: без ограничување (0).\n#   * fields (список на вредности одделени со запирка): Ова се полињата што ќе се користат. Допуштени се наслов, текст, auxiliary_text (помошен текст), opening_text (воведен текст), заглавија и сите.\n#   * use_fields (точно|неточно) : Укажете му на барањето „повеќе вакви“ да ги користи само податоците од полето. По основно: неточно — системот ќе ја извади содржината на полето за текст за да го срочи барањето.\n# Примери за добри редови:\n# min_doc_freq:2\n# max_doc_freq:20000\n# max_query_terms:25\n# min_term_freq:2\n# percent_terms_to_match:0.3\n# min_word_len:2\n# max_word_len:40\n# fields:text,opening_text\n# use_fields:true\n# </pre> <!-- не го менувајте редов -->",
	"cirrussearch-didyoumean-settings": "  #<!-- не го менувајте редов --> <pre>\n# Оваа порака ви овозможува да ги наместите поставките за предлозите „Дали мислевте на“.\n# Поврзано https://www.elastic.co/guide/en/elasticsearch/reference/current/search-suggesters-phrase.html\n# Направените промени веднаш се спроведуваат.\n# Синтаксата е следнава:\n#   * Сето она од знакот „#“ до крајот на редот е коментар.\n#   * Секој непразен ред е назив на поставката проследен од знак „:“, проследен од вредност на поставката\n# Поставките се следниве :\n#   * max_errors (цел број): најголемиот број на изрази што ќе се сметаат за грешно напишани со цел да се срочи исправката. 1 или 2.\n#   * confidence (подвижна децимала): Степенот на доверба го одредува чинителот што се применува врз бодувањето на внесените изрази, кое се користи како праг за другите кандидати за предлози. Во исходот ќе се појават само кандидатите со бодови над прагот. На пример, 1.0 ќе даде само предлози со повеќе бодови од внесениот израз. Ако се зададе 0.0, ќе се дадат најдобрите N кандидати.\n#   * min_doc_freq (подвижна децимала од 0 на 1): Најнискиот праг во број на документи во кои треба да се јави предлогот.\n#                   Најчестите поими начелно се шумливи зборови“.\n#   * max_term_freq (подвижна децимала од 0 на 1): Највисокиот праг во број на документи во кои треба да се јави предлогот.\n#   * prefix_length (цел број): Најмал допуштен број на знаци во претставка што мора да се совпаднат за да се предложи.\n#   * suggest_mode (потребни, популарни, секогаш): Режимот на предлози контролира какви предлози ќе бидат вклучени или кои изрази во текстот ќе се земат за предлози.\n# Примери за добри редови:\n# max_errors:2\n# confidence:2.0\n# max_term_freq:0.5\n# min_doc_freq:0.01\n# prefix_length:2\n# suggest_mode:always\n#\n# </pre> <!-- не го менувајте редов -->"
}
