{
	"@metadata": {
		"authors": [
			"Bjankuloski06"
		]
	},
	"cirrussearch-desc": "Пребарување со Solr",
	"cirrussearch-backend-error": "Не можам наполно да го изведам пребарувањето поради привремен проблем. Обидете се подоцна.",
	"cirrussearch-parse-error": "Не го разбрав барањето. Упростете го. Ова го заведувам за да го подобриме пребарувачкиот систем.",
	"cirrussearch-now-using": "Ова вики користи нов пребарувач. ([[mw:Special:MyLanguage/Help:CirrusSearch|Дознајте повеќе]])",
	"cirrussearch-ignored-headings": " #<!-- не менувајте ништо во овој ред --> <pre>\n# Заглавија што ќе се занемарат при пребарувањето.\n# Измените во ова ќе стапат на сила штом ќе се индексира страницата со заглавието.\n# Можете да наметнете преиндексирање на страницата ако извршите празно уредување.\n# Синтаксата е следнава:\n#   * Сето она што од знакот „#“ до крајот на редот е коментар\n#   * Секој непразен ред е точниот наслов што треба да се занемари, разликувајќи големи од мали букви и сето останато\nНаводи\nНадворешни врски\nПоврзано\n #</pre> <!-- не менувајте ништо во овој ред -->",
	"cirrussearch-boost-templates": " #<!-- не менувајте го овој ред --> <pre>\n# Ако една страница содржи еден од овие шаблони, тогаш добиеното салдо од пребарувањето се множи со зададениот постоток.\n# Измените во ова веднаш стапуваат на сила.\n# Синтаксата е следнава:\n#   * Сето она што стои од знакот „#“ до крајот на редот е коментар\n#   * Секој непразен ред претставува точно има на шаблонот за оптимизирање (сосе именскиот простор, запазени големи/мали букви и сето останато), проследено од знакот „|“, па број, па знакот „%“.\n# Примери за редови што работат:\n# Шаблон:Добро|150%\n# Шаблон:Многу добро|300%\n# Шаблон:Лошо|50%\n# Примери за редови што не би работеле:\n# Шаблон:Foo|150.234234% <-- не се дозволени децимали!\n# Foo|150% <--- технички работи, но за превметнување на страницата „Foo“ од главниот именски простор\n# Можете да ги испробате измените во поставките извршувајќи барање со претставката boost-templates:„XX“, каде XX се сите шаблони што сакате да ги оптимизирате одделени со празни места наместо нови редови.\n# Барањата што укажуваат boost-templates:„XX“ ја занемаруваат содржината на ова поле.\n #</pre> <!-- не менувајте го овој ред -->",
	"cirrussearch-pref-label": "Ново пребарување",
	"cirrussearch-pref-desc": "Пробајте го нашето ново пребарување кое поддржува поголем број јазици, дава потековни и понавремени резултати, па дури и наоѓа текст во шаблони."
}
