{
	"@metadata": {
		"authors": [
			"Soumaya",
			"Raizkgh",
			"Amire80"
		]
	},
	"cirrussearch-desc": "MediaWiki baoob sẽn yaa ne baoob sẽn pa tar pãng",
	"cirrussearch-backend-error": "D pa tõog n maan y baoobã wakat bilf yĩng ye. Bas-y tɩ b le maan dẽ poore.",
	"cirrussearch-parse-error": "B pa wʋmd sokrã võor ye. Bɩ y maan-a-la nana-nana. B ra gʋlsda sogsgã n na n sõng-a t'a paam n paas a baoobã pãnga.",
	"cirrussearch-too-busy-error": "Rũndã-rũndã, b baooda neb wʋsg n na n maan bũmbu. Bas-y tɩ b le maan dẽ poore.",
	"cirrussearch-regex-empty-expression": "A $1 gũudame tɩ b wilg tɩ b pa yɩ zaalem ye.",
	"cirrussearch-regex-syntax-error": "Yel-wẽn-kãseng sẽn be sõn-vɩɩs sẽn pa maandã pʋgẽ: $2: $1",
	"cirrussearch-regex-too-busy-error": "Sẽn yaa tɩlae ne-b tɩ b bao b sẽn na n yeel bũmb ningã. Bas-y tɩ b le maan dẽ poore.",
	"cirrussearch-regex-too-complex-error": "Yaa toog tɩ d gom ne nebã. Bao n bãng bũmb wʋsg sẽn tõe n sõng-y tɩ y tõog n yɩ sõss n paas n paas y sẽn tõe n maan to-to [[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|here]].",
	"cirrussearch-now-using": "Wiki kãngã tũnugda ne baoosg kʋɩlen-kãseng a ye. ([[mw:Special:MyLanguage/Help:CirrusSearch|Learn more]])",
	"cirrussearch-ignored-headings": "# # Sõss nins b sẽn na n bao n pa getẽ wã. # Sẽn na yɩl n tõog n bãng tɩ b pa segd n maan bũmb ning sẽn pa segdã, b segd n toeemame. # Y tõe n kɩtame tɩ seb-kãngã lebg n lebg n ningd a taab n maan sõor sẽn pa zems ye. # B sẽn gʋlsd bũmb ningã yaa woto: # * B sẽn gʋls bũmb fãa, \"#\" wã n tãag sõorã baasg yaa sõsg. * Bõn-kãng fãa yaa yʋ-peelem sẽn yaa sõma n na n yɩg n pa yã ye. Sõsg ning sẽn be sɛb nins sẽn be sɛbã pʋgẽ",
	"cirrussearch-boost-templates": "# # Pag sã n tar makr-kãensã a yembr, a baoobã sõor yaa b sẽn yãkd sõorã n paas n paas sõor sẽn yaa sõor sẽn be a pʋgẽ wã. # B sẽn toeem bũmb ning fãa wã na n kẽe n kẽame. # B sẽn gʋlsd bũmb ningã yaa woto: # * B sẽn gʋls bũmb fãa, hal tɩ sɩng ne \"#\" wã n ta rʋʋngã baasgẽ, yaa gom-biis bala. * Bõn-vẽng fãa sẽn pa yɩ zaalem yaa malɛk yʋʋr sẽn zems tɩ b paas, yʋy zĩiga, zĩiga la bũmb fãa, tɩ \"#di\" karẽn-biis pʋgd ne sõor sẽn pʋgd ne \"%\" karẽn. # Makda sõor sẽn yaa sõma: # Makda:Rõog sẽn yaa sõma 150 # Makda::Rõog-rõog sẽn ya sõma 300% # Makda:\"Rõog n yaa wẽnga 50% # Makda sẽn yaa sõma n pa tʋmd ye: # Makd:Rõogo:Rõgo:Rõoga 1500.234234% &lt;-- pa tar sor n na n yãk sõor sẽn pa zems ye! # Foo ka 150% &lt;--- sẽn yaa sõma, la f sã n dat n dɩk f Foo wã n yiis f sõssã zĩigẽ, f tõe n maana mak-sõngã n mak f sõss-sõssã n mak f sẽn dat n maan bũmb ningã. # Sogs-kãensã sẽn wilgd tɩ b rat n paasd bũmb nins sẽn be zĩ-kãngã pʋgẽ wã yaa: \"XX\" # Yaa sɩd tɩ yaa sõma",
	"cirrussearch-pref-label": "Baoosg a ye",
	"cirrussearch-pref-desc": "Mak-y tõnd baoob-paalgã sẽn sõngd tɩ buud-goam wʋsg lebg sõma, n kõt-y leoor sẽn pa kaoosd n paase, la y tõe n yãe sõsg sẽn be makr pʋgẽ.",
	"cirrussearch-give-feedback": "Sõs-y-d ne y tagsgo",
	"cirrussearch-morelikethis-settings": "# Sõnd-kãngã kɩtdame tɩ y tõe n yãk \"bõn-kãngã sẽn wõnd woto\" wã sẽn dat n maan to-to wã.\n# B sẽn toeem bũmb ning fãa wã na n kẽe n kẽame.\n# B sẽn gʋlsd bũmb ningã yaa woto:\n# * B sẽn gʋls bũmb fãa, hal tɩ sɩng ne \"#\" wã n ta rʋʋngã baasgẽ, yaa gom-biis bala.\n# * Bõn-vẽng fãa sẽn pa yɩ zaalem yaa \":\" la b pʋgd-a ne \":\" la a pʋgd-b ne \"value de réglage\".\n\n# * max_doc_freq (nambr): Sɛb sõor sẽn ta zĩig sẽn zãre (bõn-bõoneg fãa) sẽn tar wakat sẽn na yɩl n ges-b yellã.\n#                 Sẽn yaa sõma tɩ b gomd ne nebã yaa \"sẽn pa gomd ne nebã\"\n# * max_query_terms (integger): Sõng sẽn yaa kãseng n tog n yɩlẽ n bãng. Sõng-kãngã yaa $wgCirrusSearchMoreLikeThisMaxQueryTermsLimit (100).\n# * min_term_freq (integger): Yaa naoor a wãn la gom-biigã pukd lekollã pʋgẽ. Sõng-kãnga sẽn yaa to-to wã wɛɛngẽ, sõng-kãkãnga segd n yɩɩ 1.\n# * minimum_should_match (% -100% to 100%, wala sõor sẽn yaa sõor fãa): Sõs nins sẽn segd n tũ ne sõorã sõor sẽn ya %. B sẽn pa rat n togs tɩ b yaa neb 30 wã yĩnga.\n# * min_word_len (integger): Sõng sẽn segd n tall n tall yõod n yɩɩdã. D sẽn pa rat n togs tɩ yaa 0.\n# * max_word_len (tʋʋm sõor): Sõnd sẽn yɩɩd sõnd sẽn na n yɩlem n pa kelg ye. D sẽn pa tõe n yãk d sẽn dat n maan bũmb ningã\n# * zĩn-dãmbã (vɛrse rãmb sõor sẽn pa tar kom-n-taase): Yaa zĩn-kãens la d segd n tũ. Sõng-d tɩ d bãng tɩ d tõe n paama koe-moonegã võore.\n# Makr sẽn yaa sõma:\n# min_doc_freq:2\n# max_doc_Freq:20000\n# max_query_terms:25\n# min_term_freq:2\n# minim_should_match:30%\n# min_word_len:2\n# max _word_len:40\n# fields:text,opening_text",
	"cirrussearch-didyoumean-settings": "# # Sõsg kãngã kɩtdame tɩ f tõe n yãk \"Yãmb sẽn da rat n yeelã\" tagsgã. # Ges-y me https://www.elastic.co/guide/en/elasticsearch/reference/current/search-suggesters-phrase.html # Vɛɛsg ning sẽn be rẽ pʋgẽ wã na n kẽe n kẽe tʋʋm pʋgẽ tao-tao. # B sẽn gʋlsd bũmb ningã yaa woto: # * B sẽn gʋls bũmb fãa, hal tɩ sɩng ne \"#\" wã n ta rʋʋngã baasgẽ, yaa gom-biis bala. # * Bõn-vẽng fãa sẽn pa yɩ zaalem yaa sõor ning b sẽn boond tɩ \":\" sẽn pʋgd ne sõor ning sẽn pʋgd n pʋgd n kõ sõor ning a sẽn pʋgdã. Yaa a yembr bɩ a yiib. # * kɩs-sɩd (dũniyã pʋgẽ): Dẽnd d tõe n yeelame tɩ d sã n dat n bãng d sẽn tõe n maan bũmb ning, d segd n bao n bãng d sã n na n maan bũmb n sõng-d tɩ d bãng d sẽn segd n maan bũmb ningã. Sẽn na n paam n paam n yɩɩd koe-moonegã koe-moonegã, b na n baoo n paama koe-moonego. Wala makre, ned sẽn tar kɩs-sɩd ne a soabã sẽn yaa 1,0, a na n leoka sagls nins sẽn tar yõod n yɩɩd gom-biis nins a sẽn gʋlsã. B sã n yãk tɩ b yɩ 0.0, b na n lebs-a lame. # * min_doc_freq (float 0 to 1): Yaa minimã koe-moonegã sõor la b segd n wilg tɩ b rat n maan bũmb n wilg tɩ bũmb n beẽ. # Sẽn yaa sõma tɩ b gomd ne nebã yaa \"sẽn pa gomd ne nebã\" # * max_term_freq (float 0 to 1): Yaa sõor sẽn yaa kãseng n yɩɩd sɛb nins pʋgẽ sõor tõe n zĩnd tɩ b tõe n naag n naag n sõdg-a wã. # * prefix_length (integer): Yaa prefix sõor sẽn yaa minim sẽn segd n zems ne gom-biig n yɩ sogsg. # * sugere_mode (b sẽn pa yã, sẽn nong-b wakat fãa): Sugere mode wã getda sugere sẽn be to-to wã. # Makr sẽn yaa sõma: # max_erors:2 # confidence:2.0 # max_term_freq:0.5 # min_doc_freq::0.01 # prefix_length:2 # suggest_mode:always # #",
	"cirrussearch-query-too-long": "B sẽn dat n bao n bãng bũmb ning b sẽn dat n bãngã yaa sẽk n yɩɩd sẽn zems wakat ning b sẽn yetã.  (Tõnd sẽn tõe n maan woto: $1; b sẽn tõe n maane: $2)",
	"cirrussearch-query-too-long-with-exemptions": "B sẽn dat n bao n bãng bũmb ning b sẽn dat n bãngã yaa sẽk n yɩɩd sẽn zems wakat ning b sẽn yetã.  (Tõnd sẽn tõe n maan bũmb ningã: $1, d tõe n maan-a-la: $2, d pa na n sõd-a ye$3)",
	"cirrussearch-completion-profile-strict": "B sẽn yiisd sõssã sõssã, b zãmsa sõssã la b talld sõss-n-taase.",
	"cirrussearch-completion-profile-classic": "B sẽn da yãk tɩ b gʋlsd b sõssã, b sẽn yiisd b sõsdã, la b sẽn yiis b sõss-rãmbã.",
	"cirrussearch-completion-profile-normal": "B sẽn yiisd sõss-rãmb bilf la b sẽn yiisd b sõssã.",
	"cirrussearch-completion-profile-normal-subphrases": "B sẽn yiisd sõss-rãmb bilf la b sẽn yiisd b sõss-n-tɩrsã. A na n leb n wõnda sull-vɛrse (a tõe n yɩɩ sull-vɛɛs bɩ sull-vẽes sẽn yaa a sẽn tũ ne wiki wã siglgã).",
	"cirrussearch-completion-profile-fuzzy": "B sẽn maand to-to wã yaa wa b sẽn maand to - to wã ne b sẽn tõe n maneg n gʋlsd to-to (b sẽn tõe n gʋls n gʋls to-to a yiib)",
	"cirrussearch-completion-profile-fast-fuzzy": "B sẽn na n maan b sẽn tõe n maan bũmb ningã, b na n maana b sẽn tõe fãa.",
	"cirrussearch-completion-profile-fuzzy-subphrases": "B sẽn maand to-to wã yaa wa b sẽn maand to - to wã ne b sẽn tõe n maneg b gʋls-rãmbã (b sẽn tõe n gʋls-rãmb a yiib n sõng-b). A na n leb n wõnda sull-vɛrse (a tõe n yɩɩ sull-vɛɛs bɩ sull-vẽes sẽn yaa a sẽn tũ ne wiki wã siglgã).",
	"cirrussearch-qi-profile-classic": "B sẽn get bũmb nins sẽn wat ne taab n paasã, b sẽn get bũmb kẽer sẽn be seb-kãngã pʋgẽ wã, b sẽn maand bũmb ninsã, b sẽn gʋlsd bũmb ninsã, la b sẽn maand-b bũmb ninsã, n get bũmb nins fãa sẽn be sebã pʋgẽ wã yelle.",
	"cirrussearch-qi-profile-classic-noboostlinks": "B sẽn yãkd-b tɩ b tall n tʋm wiki wã pʋgẽ wã, b getame tɩ b getame b sẽn maand bũmb ninsã yaa b sẽn maand to-to.",
	"cirrussearch-qi-profile-empty": "D sẽn tõe n paam n bãng bũmb ning sẽn yaa sõma wã, d segd n bao n bãng bũmb nins sẽn yaa sõma.",
	"cirrussearch-qi-profile-wsum-inclinks-pv": "Sẽn yaa to-to wã sẽn yaa to-kãsengã sẽn yaa toɛy-toɛyã",
	"cirrussearch-qi-profile-wsum-inclinks": "Sẽn yaa to-to wã sẽn yaa to-kãsengã",
	"cirrussearch-qi-profile-popular-pv": "Sõng-n-taarã sẽn yaa pipi wã",
	"cirrussearch-qi-profile-popular-inclinks": "B sẽn tall n tall n tall b sõorã",
	"prefs-completion": "Baoosgã sẽn pidsi",
	"cirrussearch-pref-completion-section-desc": "D sẽn na n maan bũmb ning fãa",
	"cirrussearch-pref-completion-profile-help": "D rɩkd sor ning sẽn na yɩl n tõog n bao n bãng sẽn yaa sõma. mos_Latnmos_Latnmos_Latn be ye [https://www.mediawiki.org/wiki/Special:MyLanguage/Extension:CirrusSearch/CompletionSuggester completion suggester] yaa baoob sagls algoritm sẽn tar n tõe n maneg n maneg n yiis koe-bõoneg la baoob sẽn yaa sõma. Sẽn dat n bãng-b n bãng-ba, yaa b sẽn da baood n na n bãng-a to-to wã.",
	"cirrussearch-completion-profile-fuzzy-pref-name": "Dɩlla (b sẽn wilg tɩ d segd n maana)",
	"cirrussearch-completion-profile-fuzzy-pref-desc": "D tõe n paama yel-wẽn-dãmb a yiib n tõog n gʋls-a. Yãk-y n tool-y neda Yãk n tool-yãk-y tɩ y lebg n tool-yood n tool-kãnga.",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-name": "Sõndb sẽn zems ne sõndb sẽn pa tar sõndb (b sẽn dat tɩ b tall seb-kʋdb sẽn yaa kãsenga)",
	"cirrussearch-completion-profile-fuzzy-subphrases-pref-desc": "D tõe n paama yel-wẽn-dãmb a yiib n tõog n gʋls-a. Rẽ kɩtame tɩ b lebg n wa rat n bãng bũmb ning sẽn be zĩig ningã. A leb n yaa gom-bi-pugl sẽn zems ne gom-biis nins b sẽn boond tɩ gom-biisi.",
	"cirrussearch-completion-profile-strict-pref-name": "Sõng-n-taag sẽn yaa sõma (tũusg)",
	"cirrussearch-completion-profile-strict-pref-desc": "Pa le tõe n maneg b gʋlsrã ye. Pa tar n na n yeel tɩ b pa tar n kõ-a ye. Yaa sõma tɩ b zems taaba.",
	"cirrussearch-completion-profile-normal-pref-name": "Dɩlla sẽn tõe n maan bũmb ning fãa",
	"cirrussearch-completion-profile-normal-pref-desc": "Pa le tõe n maneg b gʋlsrã ye. Rẽ kɩtame tɩ b lebg n wa rat n bãng bũmb ning sẽn be zĩig ningã.",
	"cirrussearch-completion-profile-normal-subphrases-pref-name": "Yãk-y n tool-y neda Yãk a soaba",
	"cirrussearch-completion-profile-normal-subphrases-pref-desc": "D tõe n paama yel-wẽn-dãmb a yiib n tõog n gʋls-a. Rẽ kɩtame tɩ b lebg n wa rat n bãng bũmb ning sẽn be zĩig ningã. A leb n yaa gom-bi-pugl sẽn zems ne gom-biis nins b sẽn boond tɩ gom-biisi.",
	"cirrussearch-completion-profile-classic-pref-name": "Bõn-vẽng sẽn yaa pipi n bao",
	"cirrussearch-completion-profile-classic-pref-desc": "Pa le tõe n maneg b gʋlsrã ye. Yaa a Zeova n na n sõng-d lame.",
	"cirrussearch-timed-out": "B baoo-b lame tɩ b ra na n paam n bãng tɩ b pa yã ye.",
	"cirrussearch-regex-timed-out": "B sẽn da baood b sẽn na n maan bũmb ningã, b ra pa le tõe n paam b sẽn na maan bũmb ningã ye. Bao-y n tõog n wilg y sẽn yet bũmb ningã tɩ yɩ nana.",
	"cirrussearch-file-numeric-feature-not-a-number": "Baoosgo sõor ning sẽn yaa '$1' baoodame tɩ b sõor tall yõod wʋsgo, la b kõ-a-la '$2'.",
	"cirrusesarch-file-numeric-feature-multi-argument-w-sign": "Baoosgo '$1' pa kõt sor tɩ b kõ sõsg wʋsg la bãnd ne '$2' ye.",
	"cirrussearch-feature-not-available": "Sõng-kãsems ning sẽn boond tɩ \"$1\" pa be wiki kãngã pʋgẽ ye.",
	"cirrussearch-feature-too-many-conditions": "Yãk-y n tool-y neda Yãk '$1',n tool-yãk-y y sõssã $2.",
	"cirrussearch-feature-deepcat-endpoint": "$wgCirrusSearchCategoryBɩ y yãk SPARQL baasg zĩiga sẽn yaa sõma n tõog n baoo zĩiga sẽn tar pãng n paase.",
	"cirrussearch-feature-deepcat-exception": "D sẽn bao n na n bãng bũmb ning sẽn be Biiblã pʋgẽ wã pa tõog ye",
	"cirrussearch-feature-deepcat-toomany": "Sõng-y tɩ y bãng sẽn yaa to-to",
	"cirrussearch-feature-deepcat-invalid-title": "Sõngr ning b sẽn kõ wã pa zems ye.",
	"cirrussearch-feature-pageid-invalid-id": "Pag sẽn pa zems {{PLURAL:$2| ne ID| ne ID n pa zems ye}}: $1",
	"cirrussearch-incategory-feature-no-valid-categories": "Pa be kategori rãmb sẽn yaa sõma sẽn kõ '$1' ye.",
	"cirrussearch-mlt-feature-no-valid-titles": "Pa tar yʋy sẽn yaa sõma n kõ '$1' ye.",
	"cirrussearch-mlt-not-configured": "'$1' wã yaa wẽnga. Kos administrã t'a maneg $wgCirrusSearchMoreLikeThisFields",
	"cirrussearch-explore-similar-related-none": "Pa tar seb-n-taag sẽn be be wã ye",
	"cirrussearch-article-words": "Sõns nins sẽn be seb-kãsemsã fãa pʋgẽ",
	"cirrussearch-keyword-prefix-ns-mismatch": "Sõng-y tɩ y bãng tɩ b sẽn dat n bãng tɩ b yaa b rãmba, <code>all:</code> tɩ b pa tõe n bãng tɩ y pa tõe n maan bũmb nins b sẽn datã ye. Y tõe n manegame, y sẽn na n deng n bool y sogsgã ne bũmb nins fãa:",
	"cirrussearch-autoselect-profile": "Bɩ baoosgã yãk profil ning sẽn yaa sõma n yɩɩd a sẽn na n tũnug ne wã.",
	"cirrussearch-offset-too-large": "B pa tõog n paam b sõor ye. B kõ-d-la $1 ligd n na n paam n bao n bãng n bãng n bao n na n bãng n bãnga bũmb ning sẽn be a pʋgẽ wã.$2",
	"cirrussearch-offset-not-allowed-with-random-sort": "B pa sak n deeg tɩ b yãkd b sõor n na n paam b sõor ye.",
	"cirrussearch-articletopic-invalid-topic": "Sõsg ning sẽn pa be sõsg {{PLURAL:$2|name|names}} for the<kbd>article topic:</kbd>keyword:$1",
	"cirrussearch-inlanguage-deprecate-comma": "B pa segd n tũnug ne kom-bi-pugl n welg gom-bi-kãsems nins b sẽn gomd buud-gomdã pʋgẽ wã ye. Sõng-y tɩ y tũnug ne |(paayb) n welg buud-goamã."
}
