{
	"@metadata": {
		"authors": [
			"Hamilton Abreu",
			"Vitorvicentevalente",
			"Fúlvio"
		]
	},
	"cirrussearch-desc": "Mecanismo de procura \"Elasticsearch\" para o MediaWiki",
	"cirrussearch-backend-error": "Não foi possível concluir a pesquisa devido a um problema temporário. Tente novamente mais tarde, por favor.",
	"cirrussearch-parse-error": "O pedido de pesquisa não foi compreendido. Simplifique-o, por favor. O pedido foi registado para melhorar o sistema de pesquisa.",
	"cirrussearch-too-busy-error": "De momento, a pesquisa está muito ocupada. Por favor, tente novamente mais tarde.",
	"cirrussearch-too-busy-for-you-anonymous-error": "Há demasiadas pesquisas simultâneas em execução. Se estiver a partilhar um endereço IP com outros utilizadores, pode autenticar-se para obter seus próprios limites.",
	"cirrussearch-too-busy-for-you-logged-in-error": "Há demasiadas pesquisas simultâneas em execução.",
	"cirrussearch-regex-syntax-error": "Erro de sintaxe regular em $2: $1",
	"cirrussearch-regex-too-busy-error": "Estão a ser executadas demasiadas pesquisas com expressões regulares. Por favor, tente novamente mais tarde.",
	"cirrussearch-regex-too-complex-error": "A expressão regular é demasiado complexa.  Saiba mais como simplificá-la [[mw:Special:MyLanguage/Help:CirrusSearch/RegexTooComplex|aqui]].",
	"cirrussearch-now-using": "Esta wiki está a utilizar um novo motor de busca.\n([[mw:Special:MyLanguage/Help:CirrusSearch|Saiba mais]])",
	"cirrussearch-ignored-headings": " #<!-- deixe esta linha exatamente como ela está --> <pre>\n# Títulos de página que serão ignorados pela pesquisa.\n# Mudanças a esta lista terão efeito quando a página com o título referido for indexada.\n# Pode forçar a indexação de uma página realizando uma edição nula nessa página.\n# A sintaxe é a seguinte:\n#  * Tudo desde um símbolo de cardinal (#) até ao fim da linha é um comentário\n#  * Cada linha não vazia é o título exato a ignorar, respeitando o uso de maiúsculas\nReferências\nLinks externos\nVer também\n #</pre> <!-- deixe esta linha exatamente como ela está -->",
	"cirrussearch-boost-templates": " #<!-- deixe esta linha exatamente como ela está --> <pre>\n# Se uma página contiver uma destas predefinições a sua classificação na pesquisa será multiplicada pela percentagem configurada.\n# As alterações a esta página têm efeito imediato.\n# A sintaxe é a seguinte:\n#   * Tudo desde um símbolo de cardinal (#) até ao fim da linha é um comentário\n#   * Todas as linhas não vazias são o nome exato da predefinição cuja classificação deve ser alterada, incluindo o espaço nominal e respeitando o uso de maiúsculas, seguido pelo carácter \"|\", seguido por um número, seguido pelo carácter \"%\".\n# Exemplos de linhas corretas:\n# Predefinição:Boa|150%\n# Predefinição:Muito muito boa|300%\n# Predefinição:Má|50%\n# Exemplos de linhas que não terão efeito:\n# Predefinição:Exemplo|150.234234% <-- não são permitidos algarismos decimais!\n# Exemplo|150% <--- funciona do ponto de vista técnico, mas só para tansclusão da página Exemplo no espaço nominal principal\n# Pode testar alterações da configuração realizando uma pesquisa com a forma boost-templates:\"XX\" onde XX são todas as predefinições cuja classificação pretende alterar, separadas por espaços em vez de quebras de linha.\n# As pesquisas com a forma boost-templates:\"XX\" ignoram o conteúdo deste campo.\n #</pre> <!-- deixe esta linha exatamente como ela está -->",
	"cirrussearch-pref-label": "Nova pesquisa",
	"cirrussearch-pref-desc": "Experimente a nossa nova forma de pesquisa que suporta um maior número de idiomas, fornece resultados mais actualizados e pode ainda encontrar o texto incluído em predefinições.",
	"apihelp-cirrus-config-dump-description": "Dump da configuração do CirrusSearch.",
	"apihelp-cirrus-mapping-dump-description": "Dump do mapeamento do CirrusSearch para esta wiki.",
	"apihelp-cirrus-settings-dump-description": "Dump das configurações do CirrusSearch para esta wiki.",
	"apihelp-cirrus-suggest-description": "Sugerir conclusões para o termo pesquisado.",
	"cirrussearch-give-feedback": "Dê-nos a sua opinião"
}
