{
	"@metadata": {
		"authors": [
			"Kunal Mehta",
			"Shirayuki",
			"Siebrand",
			"Srolanh",
			"Umherirrender",
			"Dcausse",
			"Amire80"
		]
	},
	"cirrussearch-desc": "{{desc|name=Cirrus Search|url=https://www.mediawiki.org/wiki/Extension:CirrusSearch}}\n\"Elasticsearch\" is a full-text search engine. See http://www.elasticsearch.org/",
	"cirrussearch-backend-error": "Error message shown to the users when we have an issue communicating with our search backend",
	"cirrussearch-parse-error": "Error message shown to the users when we couldn't understand the query.  For the most part we don't expect users to see this because we retry retry queries that we don't unserstand using a (hopefully) fail safe method.",
	"cirrussearch-too-busy-error": "Error message shown to the users when there are too many concurrent searches currently running and we can't allow any more to start.",
	"cirrussearch-too-busy-for-you-anonymous-error": "Error message shown to logged in users when they attempt to run more than some number of concurrent searches.  Includes a not about logging in to get their own limits if you are sharing an IP address.",
	"cirrussearch-too-busy-for-you-logged-in-error": "Error message shown to logged in users when they attempt to run more than some number of concurrent searches.  Different from the anonymous error message because anonymous users might be sharing an IP address and thus sharing limits.",
	"cirrussearch-regex-syntax-error": "Error message shown to users attempting to use a [[w:Regular expression|regular expression]] query with invalid syntax.\n\nParameters:\n* $1 - error message\n* $2 - number of characters (position), or \"unknown\" (hard-coded string)",
	"cirrussearch-regex-too-busy-error": "Error message shown to the users when they attempt a regular expression search and there are too many concurrent regular expression searches currently running and we can't allow any more to start.",
	"cirrussearch-regex-too-complex-error": "Error message shown to the users when they attempt to perform a regular expression search that cannot be implemented efficiently enough for Cirrus to try it.  Includes a link for tips to simplify the regex.",
	"cirrussearch-now-using": "Note that this wiki is using a new search engine with a link for people to learn more.  That'll contain information on filing a bug, new syntax, etc.",
	"cirrussearch-ignored-headings": "Headings that will be ignored by search. You can translate the text, including \"Leave this line exactly as it is\". Some lines of this messages have one (1) leading space.",
	"cirrussearch-boost-templates": "Templates that if contained on a page will raise or lower the score of the page in search results.  They must be specied Namespace:Template Name|<boost factor>%. You can translate the text, including \"Leave this line exactly as it is\". Some lines of this messages have one (1) leading space. \n\nThis message will be shown with left-to-right direction, so when you are translating to a right-to-left language, you may want to test how it looks in left-to-right and add right-to-left marks as needed.",
	"cirrussearch-pref-label": "Preference label for option to enable CirrusSearch by default",
	"cirrussearch-pref-desc": "Description for option to enable CirrusSearch by default",
	"apihelp-cirrus-config-dump-description": "{{doc-apihelp-description|cirrus-config-dump}}",
	"apihelp-cirrus-mapping-dump-description": "{{doc-apihelp-description|cirrus-mapping-dump}}",
	"apihelp-cirrus-settings-dump-description": "{{doc-apihelp-description|cirrus-settings-dump}}",
	"cirrussearch-give-feedback": "Used as text for an feedback link shown at the end of Special:Search result ([[mw:Extension:CirrusSearch|$wgCirrusSearchFeedbackLink]])",
	"cirrussearch-morelikethis-settings": "Settings for the More Like This query.\n\n\"More Like This\" is the English name of the feature. The feature is described at [[:mw:Help:CirrusSearch#Special prefixes]]. The prefix \"morelike\" cannot be translated anywhere, but the full name of the feature \"More Like This\" can be translated.\n\nDon't translate technical names like min_doc_freq, max_query_terms, true|false, field names title, text, auxiliary_text, opening_text, headings, all etc.\n\nFor a definition of \"stopwords\" see [[:w:en:Stop words|Stop words in Wikipedia]].",
	"cirrussearch-didyoumean-settings": "Settings for the \"Did You Mean?\" suggestions.\n\n\"Did You Mean?\" is the English name of the feature and can be translated. This feature is described at [[:mw:Help:CirrusSearch#Did_you_mean]].\n\nDon't translate technical names like max_errors, confidence, max_term_freq, min_doc_freq and suggest_mode.\n\n\"Stop words\" are words that are explicitly excluded from searching and statistics, usually because they are too frequent to be useful and meaningful. See [[:w:en:Stop words|stop words]] in the English Wikipedia."
}
