<?php

$arabicExtraStopwords = [
	// More stop words based on Egyptian Arabic (arz) and Moroccan Arabic (ary)
	'ألي', 'إِلَى', 'إلّا', 'إِلَّا', 'أمّا', 'إمّا', 'آلان', 'آن', 'آنه', 'أنّ',
	'أَنَّ', 'أَنْ', 'إِنَّ', 'إِنَّهُ', 'الأن', 'أنتِ', 'أَوْ', 'آى', 'آي', 'أيْ',
	'أَيْ', 'إى', 'إي', 'إيْ', 'أيضاً', 'أيضًا', 'بـ', 'بإن', 'بداه', 'بداها', 'وبدا',
	'بزاف', 'بعّد', 'بِها', 'بى', 'بيه', 'بيها', 'بينمّا', 'تباع', 'وتباع', 'آلتى',
	'ثُمَّ', 'جْميع', 'حتّى', 'حَيْثُ', 'د', 'بالدى', 'دى', 'دي', 'ديه', 'ديال', 'ديالو',
	'الَّذِي', 'شنو', 'وشنو', 'عَلَى', 'علي', 'علية', 'عَنْ', 'عِنْدَ', 'غَير', 'غَيْرَ',
	'فـ', 'فْـ', 'فإن', 'فَان', 'فى', 'فِيهِ', 'فِيهَا', 'فيي', 'وفيه', 'وفيها', 'قدّ',
	'كَانَ', 'وَكَانَ', 'كلّ', 'كَمَا', 'ل', 'لاً', 'لاّ', 'لَا', 'لّا', 'اللى', 'اللي',
	'اللًي', 'اللّي', 'باللى', 'باللي', 'لى', 'لي', 'لّي', 'ليان', 'ليه', 'ليها',
	'واللى', 'واللي', 'ولية', 'مَا', 'مَنْ', 'مِن', 'مِنَ', 'مِنْ', 'منة', 'مِنْهُ',
	'منًها', 'منّها', 'هاد', 'هوّ', 'هُوَ', 'هوّا', 'هيّ', 'هِي', 'ؤ', 'وفى', 'وُكِّلَ',
	'للولا', 'ولأّ', 'ولّأ', 'ولاً', 'ولاَ', 'ولاُ', 'ولاّ', 'ولّا', 'وْلا', 'وولا',
	'وولاً', 'وْمن', 'وهِي', 'وَهُوَ',
	// More stopwords based on arabic_extended_norm
	'فى', 'فیها', 'وفى', 'حتى', 'على', 'لدى',
];

return $arabicExtraStopwords;
